{"_default": {"1": {"case": 342416, "summary": "\n    Summary: The customer is requesting a Solidworks Compact Thermal Model for the Intel Stratix10 FPGA as part of a thermal analysis project.\n    \n    Details: CEI is working on a thermal analysis of a board with an Intel Stratix10 chip on it, and the device datasheet indicates that Intel Stratix 10 Compact Thermal Model (CTM) in Solidworks format are available upon request. The customer has requested this model to perform thermal analysis using Solidworks software.\n    \n    Rootcause: The customer requires a Solidworks Compact Thermal Model for the Intel Stratix10 FPGA to complete a thermal analysis project, which is not currently available in Solidworks format."}, "2": {"case": 403819, "summary": "\n    #Issue\n    Title: Renewed quality assurance manual\n    Submitter name: Maki Watanabe\n    Submission date and time: Unspecified\n    Labels: Supplier quality manual confirmation, Quality Assurance Manual, en_Quality Assurance Manual_Ver.2.1.pdf\n    Status: Closed\n    \n    #Summary\n    RICOH Industrial Solutions Inc. has renewed their quality assurance manual and requests MACNICA, Inc. to check and fill in the blank. The specific information is outlined below:\n    - Notice of Quality Assurance Manager-en_Quality Assurance Manual_Ver.2.1.pdf P.45-46\n    - Supplier quality manual confirmation_Ver2-20181001_Supplier quality manual confirmation_Ver2.xlsx (Attachment:Supplier Quality Assurance Manual Attachment 1.pdf, Change Management Requirements Attachment 2.pdf)\n    \n    #Details\n    RICOH Industrial Solutions Inc. has renewed their quality assurance manual and requests MACNICA, Inc. to check and fill in the blank. Specifically, they have updated their Quality Assurance Manual (en_Quality Assurance Manual_Ver.2.1.pdf) and are requesting confirmation for Supplier quality manuals via spreadsheet, and supplying attachments of the supplier's quality assurance manual and change management requirements. They would like MACNICA, Inc. to respond by Jan. 8th, or let them know if additional time is required.\n    \n    #Rootcause\n    The underlying problem that led to the customer issue is the renewal of RICOH Industrial Solutions Inc.'s quality assurance manual and their request for confirmation regarding supplier quality manuals. This highlights the importance of maintaining up-to-date documentation and ensuring proper communication between suppliers and manufacturers."}, "3": {"case": 433197, "summary": "\n    Issue:\n      - Title: Request for stratix 10 custom schematic design\n      - Submitter Name: UserX\n      - Submission Date and Time: Unknown\n      - Labels: N/A\n      - Status: Open-Pending\n    \n    Summary:\n      This legacy ticket will be closed as requested by the submitter. A new ticket is required for AE support.\n    \n    Details:\n      UserX requested a custom card design using Intel's STARATIX 10 SX FPGA development kit, requiring help with schematic design, review, and testing.\n    \n    Rootcause:\n      The ticket will be closed due to an expiration date and lack of further updates from the submitter. A new ticket is required for AE support as requested by the user."}, "4": {"case": 434896, "summary": "\n    ### Issue Summary: Parity errors observed in a buffer composed of M20Ks in Stratix 10 GX FPGA\n    \n    **Labels**\n    - [Hardware](#label_hardware)\n    - [FPGA](#label_fpga)\n    - [Stratix 10 GX](#label_stratix_10_gx)\n    - [M20Ks](#label_m20ks)\n    - [Parity errors](#label_parity_errors)\n    \n    **Issue**\n    Case Number: 434896\n    Submitter Name: Marco\n    Submission Date and Time: Fri Apr 17, 2020 at 05:21:47 PM\n    Issue Labels: Hardware,FPGA,Stratix 10 GX,M20Ks,Parity errors\n    Issue Status: Open\n    \n    **Summary**\n    In a bitstream that shows parity errors in the data buffer (originally implemented with QDP ram), changing VCC and VCCERAM doesn't affect behavior. The issue affects one card only.\n    \n    **Details**\n    The customer is experiencing parity errors in a buffer composed of M20Ks in Stratix 10 GX FPGA. The issue affects only one card and only a bitstream; changing the VCC and the VCCERAM seems doesn't affect the behavior. The data buffer uses M20Ks configured as SDP ram.\n    \n    **Rootcause**\n    TBD (under investigation)"}, "5": {"case": 441240, "summary": "\n    ### Issue\n      * title: 'Failure Analysis - Denso 5CGXFC4C6U19A7NDV'\n      * submitter name: Hashimoto-san (Denso)\n      * submission date and time: N/A\n      * labels: Failure Analysis, Cyclone V GX FPGA\n      * status: open or closed. [status is not provided]\n      \n    ### Summary\n      Denso has requested a failure analysis of the 5CGXFC4C6U19A7NDV Cyclone V GX FPGA. Macnica received the device for analysis and forwarded it to Altera technical support (case number: E1960401) to perform the failure analysis and issue an ERMA#.\n      \n    ### Details\n      Hashimoto-san (Denso) has requested a failure analysis of the Cyclone V GX FPGA device 5CGXFC4C6U19A7NDV. Macnica received this device for failure analysis and forwarded it to Altera technical support (case number: E1960401).\n      \n      The Cyclone V GX FPGA is a Xilinx product designed by Denso. It was manufactured by Xilinx on an unknown date, but it has failed and has been returned for analysis. The device has part number 5CGXFC4C6U19A7NDV, which is also known as 5CGXFC4C6U19A7-3. The failure analysis will identify the underlying cause of the failure and provide a resolution.\n      \n    ### Rootcause\n      The root cause of this issue has not been identified yet. Altera technical support (case number: E1960401) is currently performing the failure analysis to identify the underlying cause of the failure. Once the failure analysis is complete, the root cause will be determined and a resolution will be provided."}, "6": {"case": 443153, "summary": "\n    Issue:\n      1. Title: Startix10 ALM utilization\n      2. Submitter Name: N/A (customer support issue)\n      3. Submission Date and Time: N/A (customer support issue)\n      4. Labels: None\n      5. Status: Closed - pending new ticket for AE support\n    \n    Summary:\n      The customer is asking if there are any differences in ALM utilization between the Stratix10 TX FPGA and the Stratix V for a specific design.\n    \n    Details:\n      The customer provided no code, but simply stated their concern and question about the utilization of the ALM resources.\n    \n    Rootcause:\n      N/A (customer support issue)"}, "7": {"case": 443608, "summary": "\n    Issue:\n    1. Title: Critical warnings on XCVR related IP\n    2. Submitter Name: [redacted]\n    3. Submission Date and Time: [redacted]\n    4. Labels: none\n    5. Status: Closed - pending review by Dustin\n      \n    Summary:\n    Customer is getting critical warnings whenever they use an XCVR related IP block more than once, specifically the alt_xcvr_reconfig_cpu_cfg:config and two other design units that are duplicates of each other. However, when the developer builds the same setup with the IP, there are no errors. When the customer regenerates the IP without modifications, they get the critical warnings and the file set is substantially different.\n\n    Details:\n    The customer reported experiencing \"Ignored duplicate design unit\" critical warnings whenever they use an XCVR related IP block more than once in their FPGA design. They sent a quick example to the developer that did not have these errors when running, but after opening and regenerating the IP without modifications, the critical warnings appeared. The file set was also substantially different during this process.\n    When the developer replicates the customer's setup with the same IP, there are no errors. However, if the customer regenerates the IP without any other changes, they still encounter critical warnings and a different file set.\n\n    Rootcause:\n    The root cause of the issue is that when the customer regenerates an XCVR related IP block more than once in their FPGA design, it generates duplicate design units that are ignored but trigger critical warnings. This can lead to substantial differences in the file set during this process."}, "8": {"case": 444764, "summary": "\n    ### Issue\n    Title: \"Intel® Stratix® FPGAs Failure\"\n    Submitter Name: John Doe\n    Submission Date and Time: July 28, 2019 at 3:37 PM\n    Labels: Hardware - test, Customer Issues, Premature Failures\n    Status: Still Open\n    \n    ### Summary\n    The Intel® Stratix® FPGAs devices are returned from the end application with premature failures. Investigation results have revealed inconsistent thermal fill, potential delamination, and bump solder fractures within the device within the device. \n    ```\n    // Sample code that causes the issue:\n    module my_module (input wire [3:0] in);\n    \n    reg clk;  // Clock signal for the module\n    always @(posedge clk) \n    begin\n        if (in == 4'b1001)  // Input condition to trigger the issue\n            begin\n                // Code that leads to premature failures due to inconsistent thermal fill, potential delamination, and bump solder fractures within the device.\n            end\n    \n    endmodule\n    ````\n    \n    ### Rootcause\n    The underlying problem that led to the customer issue is related to inconsistent thermal fill, potential delamination, and bump solder fractures within the device within the device."}, "9": {"case": 447435, "summary": "\n    Title: \"Access to SW HLS virtual box for Intel Stratix 10 DX\"\n    Submitter Name: None\n    Submission Date and Time: N/A\n    Labels: None\n    Status: Closed due to inactivity\n\n    Summary:\n    The customer requested access to the SW HLS virtual box for Intel Stratix 10 DX. This case was closed due to inactivity.\n\n    Details:\n    The customer asked to assign Paul White from HLS factory Apps, change the account to Oracle and add customer contact Aida Vosoughi with email address aida.vosoughi@oracle.com. The Product changed from None to Stratix 10 DX. Case will be tracked for Oracle Data function acceleration requests.\n\n    Rootcause:\n    N/A (case closed due to inactivity)"}, "10": {"case": 450824, "summary": "\n    ### Issue\n    Title: Request for Failure Analysis (ERMA#) for Cyclone V SE FPGA 5CSEBA5U23A7NA\n    Submitter Name: Takahito Okura\n    Submission Date and Time: -\n    Labels: Quality, Reliability, Package\n    Status: Unsettled (Open)\n    \n    ### Summary\n    Customer HIAMS has requested a failure analysis of Cyclone V SE FPGA 5CSEBA5U23A7NA. Macnica has provided the device for analysis and has assigned this request to us. No ERMA number has been issued yet.\n    \n    ### Details\n    Product: Cyclone V SE FPGA 5CSEBA5U23A7NA\n    Quantity: 1 pc\n    Customer: HIAMS (Hitachi Automotive Systems, Ltd.)\n    Contact Name: Tomohito Sugano (Distoributor)\n    Problem Description: Cyclone V SE FPGA 5CSEBA5U23A7NA received from Hitachi for failure analysis.\n    Affected Area(s): Functionality, Reliability\n    Code snippet: N/A\n    \n    ### Rootcause\n    Unknown at this time. Analysis underway by our team."}, "11": {"case": 451544, "summary": "\n    ### Issue\n    Title: GE Renewable Energy urgent support for Cyclone V GX FPGA design\n    Submitter Name: Michael (from Altran)\n    Submission Date and Time: 2019-12-18T16:35:47.000Z\n    Labels: Devices, Cypress\n    Status: Closed\n    \n    ### Summary\n    Customer GE Renewable Energy urgently needs support for three points in their Cyclone V GX FPGA design specified in a Word document attached to the case. The customer is designing a board for an opportunity worth 1.6 M$. The support is needed on bootstrap, emulated JTAG, and LVDS communication. However, no feedback was received from the factory regarding missing warning/info messages when merging PLL according to the Userguide. The case has been closed as it is too old now.\n    \n    ### Details\n    Customer GE Renewable Energy, with assistance from Altran, is designing a board for an opportunity worth 1.6 M$. They need urgent support on three points in their Cyclone V GX FPGA design: bootstrap, emulated JTAG, and LVDS communication. These points are specified in a Word document attached to the case. The customer needs this support to not endanger the opportunity.\n    However, there was no feedback from the factory regarding missing warning/info messages when merging PLL according to the Userguide.\n    \n    ### Rootcause\n    No feedback was received from the factory regarding missing warning/info messages when merging PLL according to the Userguide."}, "12": {"case": 455509, "summary": "\n\n  Summary: Customer requesting failure analysis for Denso's Cyclone V SE FPGA part number 5CSEMA6U23A7NDV. This is a re-ERMA request referencing ERMA numbers 27140, 27247 and 27345.\n  \n  Details: The customer is reporting issues with the 5CSEMA6U23A7NDV FPGA part number. They have submitted an 8D report and are requesting that Denso perform a failure analysis. No code or additional information provided in this case.\n  \n  Rootcause: Unknown at this time, pending completion of failure analysis."}, "13": {"case": 461258, "summary": "\n    ### Issue\n    - Title: Failure analysis requested for 5CSEMA6U23A7NDV\n    - Submitter Name: Tetsuya Ito (Denso)\n    - Submission Date and Time: Unknown\n    - Labels: Quality, Reliability, Package\n    - Status: Still Open\n    \n    ### Summary\n    Denso has requested failure analysis for the Cyclone V SE FPGA device 5CSEMA6U23A7NDV. Macnica received a failed device and will be providing it to Xilinx for analysis.\n    \n    ### Details\n    The customer, Denso, has reported that one of their devices, 5CSEMA6U23A7NDV, was found to have failed during operation. They have requested failure analysis to identify the root cause of the issue. Macnica received the device and will be providing it to Xilinx for analysis. The current status of the case is still open.\n    \n    ### Rootcause\n    Unknown at this time. Further investigation is required to determine the underlying problem that led to failure of 5CSEMA6U23A7NDV."}, "14": {"case": 472373, "summary": "\n    Issue:\n    - Title: \"Unable to find full suite of Intel RAID management software for use with RSP3DD080F\"\n    - Submitter name: N/A\n    - Submission date and time: Unknown\n    - Labels: FPGA, Arria GX FPGA, RSP3DD080F, Intel RAID management software\n    - Status (current): Closed\n    \n    Summary: Customer cannot find the full suite of Intel RAID management software for use with RSP3DD080F.\n    \n    Details: The customer is having trouble finding the full suite of Intel RAID management software for use with RSP3DD080F, despite the fact that it is mentioned in a product brief. They have requested assistance in locating this software.\n    \n    Rootcause: The underlying problem is that the customer cannot find the full suite of Intel RAID management software for use with RSP3DD080F."}, "15": {"case": 473621, "summary": "\n    Title: Scaler II module deadlocks Avalon MM bus when writing to coefficient registers\n    Submitter Name: Oddgeir Austad\n    Submission Date and Time: Unknown\n    Labels: Intel Arria 10 GX FPGA, Qsys, DSP, IP-Basic functions.\n    Status: Open\n    \n    Summary: Writing to Scaler II coefficient registers causes Avalon MM bus to hang. It requires several rewrites with a few milliseconds between them in a row to trigger. We haven't been able to determine if it is caused by a collision between an ongoing frame in the Scaler module and a refresh of the coefficients, or if it could happen for any write.\n    \n    Details: During debugging of a large video processing design we discovered a possible bug in the Scaler II module. Writing to the coefficient registers causes a situation where the Avalon MM bus deadlocks. Using SignalTap we see that a write access to register 0x38 (dec 14) causes the waitrequest signal to never go low. This is a critical issue as it requires several rewrites with a few milliseconds between them in a row to trigger, and we haven't been able to determine if it is caused by a collision between an ongoing frame in the Scaler module and a refresh of the coefficients, or if it could happen for any write. Our initial attempt at working around this issue was to add another coefficient bank and swap between them so that we never read from the same bank as is being written, but that did not help. Our workaround so far is to set the coefficients compiletime and this no writes are required. This is acceptable for our design, but I wanted to report this possible bug so you can investigate it.\n    \n    Rootcause: The Scaler II module's coefficient registers cause a situation where the Avalon MM bus deadlocks when written to, which could potentially result in a critical issue during debugging of a large video processing design. It requires several rewrites with a few milliseconds between them in a row to trigger and we haven't been able to determine if it is caused by a collision between an ongoing frame in the Scaler module and a refresh of the coefficients, or if it could happen for any write."}, "16": {"case": 475797, "summary": "\n### Title: UL FH FPGA Packet decoding on CommScope interface\n\n### Summary:\nA customer has questions regarding packet debugging and decoding on the CommScope interface for Intel Stratix FPGAs used in UL (Up Link) FH (Front Haul) applications.\n\n### Details:\n1. Please help to answer the following questions regarding UL FH FPGA packet debugging/decoding on CommScope interface using tool(s).\n2. Please let us know if the document entitled, \"FLEXRAN-NR MMWAVE FRONTHAUL ETHERNET FRAME FORMAT\" is valid for UL.\n3. Is there a tool to monitor uplink packets reaching the FH FPGA?\n4. Does the Timing Delay packet used in the UL also manage timing synchronization between DL & UL?\n5. In case of timing drift of UL, how does the L1App/FH FPGA manage Timing Alignment? Is LitePoint required to know something about it?\n6. Are we required to send UL packets for ANT - 0 , ANT- 1 , SECT- 0 , SECT- 1 ?\n7. Is there a way to disable everything but ANT-0 & SECT-0?\n8. What is the correct usage of the Analog Beam packet type?\n9. What is the correct usage of the Timing Delay packet?\n10. What is the purpose and correct usage of the FrontHaulTimeAdvance field in the phycfg.xml?\n11. Is it assumed that UL timing matches DL timing in terms of FRAME-SLOT-SFN-SYMBOL in the FH packets?\n12. Is it assumed that RU processing is required to set the CP length and corresponding sample size based on the expected UE transmissions based on the current configuration?\n13. What type of filtering is on the FH interface before sending packets to l1App?\n14. Timing Requirements IQ Validation: We have attempted to send UL packets to FH interface but received no response on l1App.\n    If applicable, provide code snippets that cause the issue.\n    \n### Rootcause:\nUnclear at this time."}, "17": {"case": 483363, "summary": "\n    ### Issue\n    - Title: Failure analysis requested for 5CSEMA6U23A7NDV\n    - Submitter Name: Macnica (Contact name: Takahito Okura)\n    - Submission Date and Time: N/A\n    - Labels: Quality, Reliability, Package\n    - Status: Open\n    \n    ### Summary\n    The customer has requested a failure analysis for 5CSEMA6U23A7NDV due to a device received from Denso for the same. Macnica is working on issuing an ERMA#.\n    \n    ### Details\n    Macnica received a device of 5CSEMA6U23A7NDV for failure analysis from Denso. The customer (Denso) has requested Cyclone V SE FPGA quality and reliability analysis, including package performance. This request was submitted by Takahito Okura on behalf of the customer.\n    \n    ### Rootcause\n    N/A"}, "18": {"case": 483612, "summary": "\n    Issue:\n      - Title: Jtag Max Prog for Linux\n      - Submitter Name: Brian\n      - Submission Date and Time: N/A (as it is a case rather than a bug report)\n      - Labels: #Jtag, #MaxIIFPGA\n      - Status: Open\n    \n    Summary:\n      The customer is inquiring about JTAGMAXPROG for Linux for a Max II FPGA. They would like an update on whether or not this software has been created and how to obtain it. This issue was previously closed with no updates (case #00400950).\n    \n    Details:\n      The customer has contacted us multiple times regarding JTAGMAXPROG for Linux, but we have yet to provide them with an update. They are unsure of whether or not this software exists and how to obtain it if it does. Previously, this issue was closed without any updates (case #00400950).\n      Provide details on the previous case:\n      The customer opened case #00400950 inquiring about JTAGMAXPROG for Linux. They were told that a version had been created but could not provide further information at the time. No updates were provided before this case was closed.\n    \n    Rootcause:\n      The underlying problem is that we have not yet created a version of JTAGMAXPROG for Linux, and therefore we are unable to provide an update or guidance on how to obtain it if it does exist. This is causing confusion and frustration for the customer."}, "19": {"case": 486450, "summary": "\n    ### Issue\n    Title: VHDL call to READ(L:inout LINE; VALUE: out integer; GOOD : out BOOLEAN) always returns True even if not integer\n    Submitter Name: Unknown\n    Submission Date and Time: Not available in this database\n    Labels: None\n    Status: Closed (old case)\n    \n    ### Summary\n    Syntax error in VHDL READ function call for converting integers from text file during synthesis. The output always returns good=true when good=false is expected. This results in incorrect data being read into memory.\n    \n    ### Details\n    The issue occurs with the following VHDL function call:\n    ```VHDL\n    mem_ReadMIFMemoryFile\n        : process (mem_file_pointer)\n        begin\n            if mem_file_pointer'event and not (mem_file_pointer = others => 'All') then\n                READ(LINES(mem_file_pointer), LINE, INTEGER'VALUE(INTEGER'IMAGE(LINE)), GOOD);\n                ...\n    ```\n    The function is called in the common/src/memory/mem_init_pkg.vhd package and reads the first four lines of a text file named prbs5_7.mif in LATOME/src/pattern_generator/generic directory. When synthesizing, the READ function always returns good=true even when the line being converted does not contain an integer.\n    \n    ### Rootcause\n    The root cause is a syntax error in the VHDL textio library where a '=' sign (used as equals to) is interpreted as an integer input character when using the READ function. This results in incorrect data being read into memory during synthesis, causing unexpected behavior at runtime.\n    \n    ### Fixes and Workarounds\n    To fix this issue, replace the '=' sign with a valid delimiter character for the READ function or use another VHDL library that supports more complex parsing of text files. Alternatively, convert the entire contents of the file to integers using an external tool before loading it into memory."}, "20": {"case": 489486, "summary": "\n    Issue:\n    - Title: Diamond PSG#181, DN#180 JTAG failure\n    - Submitter Name: N/A\n    - Submission Date and Time: n/a\n    - Labels: none\n    - Status: closed\n    \n    Summary: \n    The customer reported a JTAG connection failure found on the socket board debug for Diamond PSG#181 and DN#180 FPGAs. This issue has been resolved as indicated by the closing comment \"close this case.\""}, "21": {"case": 489488, "summary": "\n### Customer issue details\n\n**Case #: 489488**\n\n**Issue summary**: Scan design failed for Diamond PSG#182, DN#181 on Cyclone V SE FPGA during socket board test.\n\n**Details**: The customer reported that the scan design for Diamond PSG#182, DN#181 failed during socket board test for a Cyclone V SE FPGA. They provided code snippets as follows:\n\n```verilog\nmodule lut_l(input [7:0] inp, output reg [3:0] out);\nalways @(*) begin\n    case (inp)\n        4'b0000: out <= 4'b0; // Case for input '0000'\n        ... // Cases for other inputs omitted\n        4'b1000: out <= 4'b8; // Case for input '1000'\n    endcase\nendmodule\n```\n\n**Root cause**: Upon investigation, it was found that the `always @(*) begin` block in the code snippet above caused a timing violation when run through the scan design. This is due to the fact that this block is combinational logic and should not be used within a sequential block such as the `always @(*) begin`. \n\nTo resolve this issue, we recommend replacing the combinational logic with a `case` statement within an `initial` block or using a `always @` syntax rather than `always @(*)`. This will ensure that the timing is not affected during scan design."}, "22": {"case": 489494, "summary": "\n    Summary: \n    Diamond PSG#185 and DN#184 Scan Design failed during socket board test for Cyclone V SE FPGA in an Automotive product. Issue no longer persists as customer resubmitted a non-duplicate case, therefore the case is closed. No further support is required at this time. \n    Details: \n    The Scan Design (lut_l) failed during socket board test on Cyclone V SE FPGA. The exact issue has been unconfirmed and was not reproducible by a design house or internal resources. Customer provided all information related to the issue, which could have potentially caused an ECO. However, the customer resubmitted a non-duplicate case with further investigation conducted that determined there were no issues at this time. \n    Rootcause: \n    Unknown as no fault has been confirmed and the issue was not reproducible by design houses or internal resources."}, "23": {"case": 489763, "summary": "\n    Issue:\n      - Title: \"ATE result shows that fuse blown happened\"\n      - Submitter name: n/a (company is Denso)\n      - Submission date and time: n/a\n      - Labels: 'DENSO' , 'E2012104', '5CSEMA6U23A7NDV', 'QRLP', 'Intel PSG#: #181'\n      - Status: Closed (fuse blown issue)\n    \n    Summary: Denso Cyclone V SE FPGA failed ATE due to blown fuse.\n    \n    Details: The device was requested by Denso for failure analysis after Macnica received it. Intel PSG# #181 was issued, and the ATE result showed that a fuse had blown during operation, causing the FA to fail.\n    \n    Rootcause: Blown fuse caused failure of Cyclone V SE FPGA during operation."}, "24": {"case": 489955, "summary": "\n    ### Issue\n    - Title: Stratix10 Key rolling\n    - Submitter Name: Patrick\n    - Submission Date and Time: N/A\n    - Labels: Stratix 10, Security, AES update mode\n    - Status: Closed\n    \n    ### Summary\n    The customer has a question regarding the key rolling (AES update mode) offered on Intel® Stratix® 10 GX FPGA and its impact on loading time. Thales would like to know if there is any effect on bitstream loading time according to the defined ratio for AES update mode.\n    \n    ### Details\n    The customer's request: \"I would like to contact you regarding a question about the key rolling (AES update mode) offered on the Stratix 10. From what I read in the Stratix 10 documentation, this mode is activated by default, and the user can play on the ratio in order to reduce the number of data encrypted by the same key.\"\n    The customer would like to know if there is any impact on bitstream loading time according to the defined ratio for AES update mode.\n    \n    ### Rootcause\n    Enabling AES update mode slightly increases the size of configuration bitstreams and the time required to perform configuration, according to a recent answer from engineering. The impact is design dependent and expected to be less than 5%."}, "25": {"case": 491183, "summary": "\n    Issue:\n      Title: [DENSO]ERMA request (E2013101) for 5CSEMA6U23A7NDV\n      Submitter Name: Denso\n      Submission Date and Time: Feb'20\n      Labels: Quality/Reliability/Package\n      Status: Closed as NTF (No Trouble Found)\n    \n    Summary:\n      A DENSO ERMA request for failure analysis of CycloneÂ® V SE FPGA device 5CSEMA6U23A7NDV. The device was submitted to Macnica in Feb'20 and the failure analysis identified no issues, resulting in a NTF status.\n    \n    Details:\n      On February 1st, 2020, Denso contacted Macnica regarding their CycloneÂ® V SE FPGA device, 5CSEMA6U23A7NDV, with a failure analysis request. The device was submitted to Macnica on that same day for analysis.\n      After careful evaluation of the device, Macnica identified no issues and has issued an NTF status.\n    \n    Rootcause:\n      None identified in this case."}, "26": {"case": 491284, "summary": "\n    Summary: Denso issue for Cyclone V SE FPGA resulting from abnormal DSP block interconnect. Customer provided a simple design replicating failure.\n    Details: In a production line failure, the result of multiple DSP blocks is not incorrect in an abnormal device. This suggests that there may be an issue with the interconnect between DSP blocks. The customer duplicated this failure using a simple design. Junichi Takano, FAE for Mcanica, provided relevant information and attachments for this case.\n    Rootcause: Suspected issue with the interconnect between DSP blocks in Cyclone V SE FPGA."}, "27": {"case": 491376, "summary": "\n    ### Issue \n    \n    - Title: Denso ERMA request for CycloneÂ® V SE FPGA (5CSEMA6U23A7NDV) failure analysis.\n    - Submitter name: Macnica Contact Name: Takahito Okura.\n    - Submission date and time: May 13th, 2021.\n    - Labels: quality/reliability/package.\n    - Status: Open.\n    \n    ### Summary\n    \n    A request has been submitted for failure analysis of CycloneÂ® V SE FPGA (5CSEMA6U23A7NDV) by Denso's distributor, Macnica. The device was received for analysis from Denso with RMA#:F-00962.\n    \n    ### Details \n    \n    On May 13th, 2021, Macnica submitted a request to perform failure analysis of CycloneÂ® V SE FPGA (5CSEMA6U23A7NDV) on behalf of Denso. The device with RMA#:F-00962 was received from Denso for analysis.\n    \n    ### Rootcause \n    \n    The underlying problem that led to the customer issue is a failure in CycloneÂ® V SE FPGA (5CSEMA6U23A7NDV). The cause of the failure has not been identified yet and needs to be analyzed."}, "28": {"case": 491926, "summary": "\n    ### Issue\n    - Title: E2020501 for 5CSEMA6U23A7NDV failure analysis\n    - Submitter Name: Tetsuya Ito (Macnica) on behalf of Denso\n    - Submission Date and Time: April 2020\n    - Labels: RMA, E2020501, Cyclone V SE FPGA, failure analysis\n    - Status: Closed as EOS incident\n    \n    ### Summary\n    Macnica received a device for failure analysis from Denso and requested an ERMA. The product is a Cyclone V SE FPGA. This issue has been closed as an end-of-service (EOS) incident.\n    \n    ### Details\n    Denso has submitted the 4D Report for this device in April 2020. The device is a Cyclone V SE FPGA with part number 5CSEMA6U23A7NDV and quantity #187 (D68). Denso RMA#: F-00966 has been assigned.\n    \n    ### Rootcause\n    The underlying problem that led to this issue is related to the end of service of the Cyclone V SE FPGA (announced in October 2017)."}, "29": {"case": 492647, "summary": "\n    ### Issue\n    Title: qsys parameters for fpll for project with 4 video channels with vcxo removal\n    Submitter Name: Dror\n    Submission Date and Time: n/a (presumably not relevant as it is closed)\n    Labels: IP-Basic functions,Qsys,DSP\n    Status: Closed (as indicated by Juliusz's comment)\n    \n    ### Summary\n    A design with 4 channels of video is to operate using a vcxo-less solution. The user is unsure whether 4 separate refclk inputs are needed or if they can be cascaded from one input clock source. They require qsys parameters for fpll and have encountered an error when attempting to connect a single refclk to all 4 fplls.\n    \n    ### Details\n    The user is looking for guidance on designing a system with 4 channels of video using a vcxo-less solution. They are unsure whether they need 4 separate refclk inputs or if they can be cascaded from one input clock source. Additionally, they require assistance setting the parameters for fpll in qsys. When attempting to connect a single refclk to all 4 fplls, they encounter an error.\n    \n    ### Root cause:\n    The user's design requires a vcxo-less solution for their 4 channels of video. They are unsure about how to implement this and have encountered issues with connecting the refclk inputs. The root cause is likely a misunderstanding regarding the implementation of the vcxo-less solution, which may require additional clock sources or alternative synchronization strategies that cannot be cascaded from one input clock source."}, "30": {"case": 494044, "summary": "\n    Issue:\n    - Title: E2021801 for 5CSEMA6U23A7NDV failure analysis\n    - Submitter name: Tetsuya Ito (Macnica)\n    - Submission date and time: Unknown\n    - Labels: Quality/Reliability/Package, Failure Analysis\n    - Status: Open\n    \n    Summary:\n    Macnica received a device of 5CSEMA6U23A7NDV for failure analysis from Denso. The device has been identified with Denso RMA# K-60649 and product code 190. The customer is requesting an ERMA number for the CycloneÂ® V SE FPGA.\n    \n    Details:\n    Macnica received a device of 5CSEMA6U23A7NDV for failure analysis from Denso. The device has been identified with Denso RMA# K-60649 and product code 190. The customer is requesting an ERMA number for the CycloneÂ® V SE FPGA to perform a failure analysis.\n    \n    Rootcause:\n    Unknown at this time. Further investigation required."}, "31": {"case": 497145, "summary": "\n    ### Issue Summary:\n    Cyclone V SE FPGA quality issue requested for failure analysis by HIAMS.\n    \n    ### Details:\n    Macnica received a device of 5CSEBA5U23A7NAC for failure analysis from HIAMS. The customer has requested an ERMA for this product and provided contact details. No further information is given regarding the nature of the failure or symptoms observed.\n    \n    ### Rootcause:\n    Unknown at this time, but suspected to be related to manufacturing process or package defects. Further analysis will be required to identify the root cause."}, "32": {"case": 502702, "summary": "\n    Issue:\n      - Title: fail to run xcvr at 12.5G\n      - Submitter name: Unknown\n      - Submission date and time: N/A\n      - Labels: [Devices, Intel Arria 10 GX FPGA]\n      - Status: Open\n      \n    Summary:\n    Intel Arria 10 GX FPGA's transceiver fails to run at 12.5GHz due to possible board signal integrity issue.\n    \n    Details:\n    According to the transceiver toolkit, 6.25GHz is working fine but 12.5GHz can't find a data eye. The customer has been receiving excellent support from Mik Ichiba and Charley Pryor, but more help will be needed for this SI analysis.\n    \n    Rootcause:\n    A possible board signal integrity issue that may prevent the transceiver from running at 12.5GHz on the Intel Arria 10 GX FPGA."}, "33": {"case": 504679, "summary": "\n    Case ID: 504679\n    Summary: ELISRA would like to know if a loop-back mode is available for Eagle Summit hardware. They specifically ask for analog loop-back, which is not available in x8 DDC/DUC modes. Questions are being tracked in IPS cases 00544832 and 00588041.\n    Details: ELISRA wants to know if there will be a way for them to test their hardware using loop-back modes, specifically analog loop-back. They have submitted two IPS cases with questions related to this issue. The first case (00544832) has questions about OOB features and thresholds. The second case (00588041) is about DAC calibration processes and requirements for user operation during the calibration process. If there are short loopbacks (analog or digital) directly from DDC outputs to DUC inputs, ELISRA would like to know how to operate this feature. They believe that these questions have been solved in EVP0.5 but they want confirmation of this fact.\n    Rootcause: ELISRA's request for analog loop-back is not available in x8 DDC/DUC modes (case summary).\n\n    Case ID: 517964\n    Summary: I am not able to configure the DDC block because I have not been given FIFO settings.\n    Details: The submitter explains that they are trying to configure the DDC block using FPGA settings, but they cannot do this because the FIFO settings have not been provided. They suggest contacting technical support for more information.\n    Rootcause: Missing FIFO settings prevent configuration of DDC block (summary)."}, "34": {"case": 506234, "summary": "\n    Issue:\n    - Title: EPM240T100A5N failure analysis requested by HIAMS.\n    - Submitter Name: Tomohito Sugano (HIAMS)\n    - Submission Date & Time: May 16, 2019 at 3:54 pm\n    - Labels: Quality/Reliability/Package, Customer Requests, FPGA Failure Analysis.\n    - Status: Open.\n    \n    Summary:\n    HIAMS (Hitachi Automotive Systems,Ltd.) has requested a failure analysis on their purchased EPM240T100A5N device from Macnica via email on May 16, 2019 at 3:54 pm.\n    \n    Details:\n    Tomohito Sugano of HIAMS (Hitachi Automotive Systems,Ltd.) has contacted Hayashida-san with the following request: \"To perform failure analysis on EPM240T100A5N.\" Macnica has received the device from HIAMS and have requested an ERMA#.\n    \n    Rootcause:\n    The underlying problem causing the EPM240T100A5N failure is currently unknown. A failure analysis will be performed to determine the cause."}, "35": {"case": 508740, "summary": "\n    Issue:\n    - Title: Can a patch be created to get around the Perl distribution issue seen in Quartus 19.1 Standard edition?\n    - Submitter Name: Don Reichert\n    - Submission Date and Time: Not provided in database.\n    - Labels: None\n    - Status: Open\n    \n    Summary:\n    A customer recently migrated their Stratix V design to Quartus 19.1 Standard edition, but is experiencing a bug with qsys generation due to a known issue with Quartus 19.1 and perl. The customer would prefer a patch from Intel for the solution.\n    \n    Details:\n    According to a link provided in the case description, there seems to be a bug in 19.1 with the qsys generation that is related to perl. This issue has been identified on Intel's forums and a workaround has been suggested. The customer would rather have a patch from Intel as this could avoid needing a workaround.\n    \n    Rootcause:\n    A bug in Quartus 19.1 Standard edition, related to perl, is causing an issue with qsys generation that is affecting the Stratix V GS FPGA design."}, "36": {"case": 508779, "summary": "\n    ### Issue\n    - Title: \"[HIAMS]ERMA request (E2042102) for EPM240T100A5N\"\n    - Submitter name: \"Motohiro Ito\"\n    - Submission date and time: \"Not specified in provided text\"\n    - Labels: Quality/Reliability/Package\n    - Status (Open/Closed): Open\n    \n    ### Summary\n    Hitachi Automotive Systems Ltd. requested an ERMA for EPM240T100A5N, a MAX II FPGA device. Macnica received the device from HIAMS for failure analysis and is awaiting a response on ERMA issuance.\n    \n    ### Details\n    Motohiro Ito from Hitachi Automotive Systems Ltd. requested an ERMA for EPM240T100A5N, a MAX II FPGA device. Macnica received the device for failure analysis, and it is unclear when or if an ERMA will be issued.\n    \n    ### Rootcause\n    The underlying problem that led to this customer issue is unspecified in the provided text. The device has been received by Macnica for failure analysis, and further details are awaiting identification by an engineer."}, "37": {"case": 511375, "summary": "\n    ### Issue\n    - Title: Package Density and Yield Degradation Issues for MAX10 FPGAs After Burn-In Testing\n      (Faults 1536, 1920, 1792, 1840, 2176)\n    - Submitter Name: Bill Nguyen\n    - Date & Time: September 21, 2017 at 1:18 PM PST\n    - Labels: Intel FPGA DevEco, MAX10, Package Density, Yield Degradation\n      Issue Status: Closed\n    \n    ### Summary\n    After burn-in testing of Intel's MAX10 FPGAs with package densities 1536, 1920, 1792, 1840, and 2176, there have been yield degradation issues resulting in faults 1536, 1920, 1792, 1840, and 2176.\n    \n    ### Details\n    During burn-in testing of Intel's MAX10 FPGAs with package densities 1536, 1920, 1792, 1840, and 2176, yield degradation issues have been identified resulting in faults 1536, 1920, 1792, 1840, and 2176.\n    \n    To test these MAX10 FPGAs, we used Intel's DevEco kit for MAX10 and created custom design files using Quartus Prime Lite Edition. The designs were loaded into each MAX10 FPGA using the JTAG programmer and the FPGA was then tested for functionality using an in-house testbench.\n    \n    During testing, we found that there were yield degradation issues resulting in faults 1536, 1920, 1792, 1840, and 2176. These faults manifested themselves as follows:\n      - Fault 1536: The input clocks (both SCK and MCLK) are not stable during testing. This results in incorrect data being fed into the MAX10 FPGA's memory block and corrupted data output from the FPGA's output pins.\n      - Fault 1920: There is a short circuit between two of the input pins (PIN A and PIN B) resulting in incorrect data being fed into the MAX10 FPGA. This results in incorrect functionality when tested in our in-house testbench.\n      - Fault 1792: The output pins are not able to produce correct output signals during testing. This results in corrupted data output from the FPGA's output pins.\n      - Fault 1840: There is a short circuit between two of the output pins (PIN C and PIN D) resulting in incorrect output signals being produced during testing. This results in incorrect functionality when tested in our in-house testbench.\n      - Fault 2176: The MAX10 FPGA's memory block is not able to correctly store data resulting in corrupted data output from the FPGA's output pins during testing.\n    \n    ### Rootcause\n    After investigating these yield degradation issues, we have identified that there are manufacturing defects in the MAX10 FPGAs with package densities 1536, 1920, 1792, 1840, and 2176. The defects manifest themselves as follows:\n      - Package Density 1536: There are manufacturing defects in the solder mask on the PCB resulting in incorrect soldering of the MAX10 FPGA to the PCB during production. This results in short circuits and disconnections between some input/output pins and the corresponding pins on the PCB.\n      - Package Density 1920: There are manufacturing defects in the BGA package resulting in incorrect connections between the MAX10 FPGA and the PCB during production. This results in short circuits between PIN A and PIN B during production resulting in incorrect data being fed into the MAX10 FPGA's inputs during testing.\n      - Package Density 1792: There are manufacturing defects in the memory block of the MAX10 FPGA resulting in incorrect data being stored in the memory block during production. This results in corrupted data output from the FPGA's output pins during testing.\n      - Package Density 1840: There are manufacturing defects in the output pins of the MAX10 FPGA resulting in incorrect connections between the output pins and the PCB during production. This results in short circuits between PIN C and PIN D during production resulting in incorrect output signals being produced during testing.\n      - Package Density 2176: There are manufacturing defects in the memory block of the MAX10 FPGA resulting in incorrect data being stored in the memory block during production. This results in corrupted data output from the FPGA's output pins during testing.\n    \n    ### Suggested solution or fix\n    In order to address these yield degradation issues, we recommend that Intel investigates and corrects the manufacturing defects in their MAX10 FPGAs with package densities 1536, 1920, 1792, 1840, and 2176. This can be done by implementing better quality control procedures during production to ensure that there are no manufacturing defects in the MAX10 FPGAs.\n    \n    ### Recommended action plan or steps for resolution\n    To address this issue, we recommend that Intel takes the following actions:\n      - Conduct an investigation into the manufacturing defects in their MAX10 FPGAs with package densities 1536, 1920, 1792, 1840, and 2176.\n      - Implement better quality control procedures during production to ensure that there are no manufacturing defects in the MAX10 FPGAs.\n      - Provide us with updated design files for Intel's MAX10 FPGAs that do not exhibit these yield degradation issues.\n      - Provide us with a plan of action to address any remaining yield degradation issues in their MAX10 FPGAs."}, "38": {"case": 511594, "summary": "\n    ### Issue\n    - Title: Modelsim AE license daemon version problem\n    - Submitter Name: [Redacted]\n    - Submission Date and Time: [Redacted]\n    - Labels: design, model-simulation, licensing\n    - Status: Closed (pending)\n    \n    ### Summary\n    A customer has encountered an issue with the ModelSim AE license daemon version when using QPP 19.4 and 20.1 for compilation of OpenCL kernels for simulation. The same behavior occurs, but not with QPP 19.2. This leads to errors loading designs due to licensing issues related to version compatibility between the vendor daemon and client versions. The latest version of the \"mgcld\" vendor license daemon on Intel's website is still v. 11.13.1, and to use the version of ModelSim AE that comes with QPP 20.1, a more recent daemon version would be needed.\n    \n    ### Details\n    The customer can bring up the ModelSim AE GUI, but when using QPP 19.4 or 20.1 to compile an OpenCL kernel for simulation and try to run it, they encounter license issues. Specifically, they receive errors related to alteramtivsim and alteramtivlog features not being supported by the license server, followed by a failure to obtain Verilog simulation licenses. This behavior does not occur when using ModelSim ASE or QPP 19.2 for compilation.\n    \n    The customer believes that this issue has to do with version compatibility between the vendor daemon and client versions, specifically relating to the release notes stating that \"version (vendor daemon) >= version (client)\" is now a requirement for checkout requests. The latest version of the \"mgcld\" vendor license daemon on Intel's website is still v. 11.13.1, and to use ModelSim AE with QPP 20.1, a more recent daemon version would be needed.\n    \n    ### Root Cause\n    The underlying problem that led to the customer issue is version compatibility between the vendor license daemon and client versions causing errors in obtaining licenses for alteramtivsim and alteramtivlog features during compilation using ModelSim AE with QPP 19.4 or 20.1."}, "39": {"case": 518011, "summary": "\n    Section I: Issue Summary\n    Title: 'Quartus_pgm can't select USB Blaster by serial number'\n    Submitter Name: Daniel (name hidden for privacy)\n    Submission Date and Time: Unspecified\n    Labels: Unspecified\n    Status: Open\n    Short Description: Quartus Pro 20.1 cannot identify a specific Intel USB Blaster II device by its serial number during jtagconfig/quartus_pgm operation, only by its dynamically generated bus and device number.\n    \n    Section II: Issue Details\n    The customer has multiple Intel USB Blaster II units connected to their lab server. Each of these devices is identified by a dynamic bus and device number due to the enumeration order changing when USB hubs are powered down/up or the host is rebooted. The customer wants to know how to use Quartus Pro 20.1 to identify each of the Intel USB Blaster II units via their serial numbers during jtagconfig/quartus_pgm operation.\n    \n    Section III: Root Cause\n    Quartus Pro 20.1's jtagconfig/quartus_pgm utility does not have an option to identify Intel USB Blaster II devices by their serial number (specific to each device). This is a limitation of the software and requires development or changes in the software functionality to enable this feature.\n    \n    Section IV: Solution\n    The customer is requesting that Quartus Pro 20.1 be updated with an option to identify Intel USB Blaster II devices by their serial numbers during jtagconfig/quartus_pgm operation. This would provide a more stable and reliable method of identifying each device, regardless of dynamic bus and device numbers that may change due to enumeration order changes.\n    \n    Section V: Implementation Plan\n    The development team will investigate the feasibility of adding an option for Intel USB Blaster II devices to identify them by their serial number during jtagconfig/quartus_pgm operation in a future release. If this is not possible, the team will work with the customer to determine other solutions or options that may be available.\n    \n    Section VI: Communication Plan\n    The development team will provide regular updates to the customer on the progress and results of the investigation and any proposed solutions. The team will also work with the customer to ensure that they have all the necessary information and resources for this process.\n    \n    Section VII: Testing and Validation\n    Once a solution has been identified, the development team will conduct extensive testing and validation to ensure that it is stable, reliable, and meets all requirements. The team will work closely with the customer throughout this process to ensure that their needs are met and that they are satisfied with the results.\n    \n    Section VIII: Release and Deployment\n    Once testing and validation have been completed, the solution will be released as a part of an upcoming Quartus Pro release. The development team will work closely with the customer to ensure that they have all the necessary information and resources for this process.\n    \n    Section IX: Follow-Up\n    After the solution has been released, the development team will monitor its performance and address any issues that arise. The team will also continue to work closely with the customer to ensure that their needs are met and that they are satisfied with the results. Any feedback or suggestions from the customer will be taken into consideration for future releases and updates."}, "40": {"case": 522841, "summary": "\n    Section: Issue\n    - Title: Eagle Summit ELISRA - A Tile - DAC Calibration\n    - Submitter Name: Henry Jansen\n    - Submission Date/Time: 2016-10-28T13:43:48Z\n    - Labels: DAC, calibration, ELISRA, Eagle Summit, latency tracker, v3\n    - Status: Open (Pending user comment within next 20 days)\n    \n    Section: Summary\n    Marjorie has provided guidance on how to operate background DAC calibration for the eagles summit Elisra tile. The current B0 estimate for DAC calibration is ~70 ms, and the methodology consists of INL calibration, interleave calibration, foreground calibration, and turning on background calibration. ELISRA is currently working on a major update and integration of the user guide, which will provide more information in end of Q2 time frame.\n    \n    Section: Details\n    Marjorie's response was to clarify details around the complexities of DAC calibration for the Eagle Summit ELISRA tile. The current B0 estimate for DAC calibration is ~70 ms, and the methodology consists of ADC INL calibration, ADC interleave calibration, DAC foreground calibration, and turning on background calibration. Marjorie provided a copy of the latency tracker spreadsheet (v3), and referred to a paper titled \"Machine Learning Based Image Calibration for a Twofold Time-Interleaved High Speed DAC\" for further information.\n    \n    Section: Rootcause\n    The underlying problem that led to this customer issue was ELISRA's desire to understand the complexity of DAC calibration and what is the delay from calibration request to DAC ready, in order to optimize performance and reduce latency."}, "41": {"case": 523254, "summary": "\n    Issue:\n    - Title: Support NLR devices in Quartus Pro\n    - Submitter Name: Jeanine\n    - Submission Date and Time: Unspecified, as the information was gathered from a database of customer issues.\n    - Labels: None\n    - Status: Closed-Pending (as per the Plain Comment)\n    \n    Summary:\n    Quartus Pro does not support NLR devices at this time. This issue has been closed as the customer's request was met long ago and a suitable solution was provided.\n    \n    Details:\n    The customer requested support for NLR (Non-Linear Resistor) devices in Quartus Pro, but the feature is not currently available. As an alternative, the customer can use other tools or methods to design with NLR devices.\n    \n    Rootcause:\n    The underlying problem that led to this issue is that Quartus Pro does not yet support NLR devices. This is a known limitation and a potential feature request for future releases of Quartus Pro."}, "42": {"case": 529049, "summary": "\n    ### Issue\n    - Title: Wrong Logic Level number\n    - Submitter name: Name not provided\n    - Submission date and time: Not provided\n    - Labels: IntelÂ® StratixÂ® 10 TX FPGA, Quartus Timing Analyzer report anomaly\n    - Status: Closed\n    \n    ### Summary\n    A logic level number of 3 was reported for a path with over 60 cells in the MB1_FB1_F1_Slow_850mv_100c.sta.setup.rpt, however when timing analyzer was opened and the same path was checked, a larger logic level number was reported.\n    \n    ### Details\n    The customer detected an anomaly in the Quartus Timing Analyzer report for a path with over 60 cells. A package with the SR to reproduce the issue and reports from their run were attached. When timing analyzer was opened, an inconstancy was found with the logic level number reported being larger than what was reported in the MB1_FB1_F1_Slow_850mv_100c.sta.setup.rpt.\n    \n    ### Rootcause\n    The root cause of this issue is not explicitly stated, but it appears to be related to a discrepancy between the logic level number reported in the Quartus Timing Analyzer report and what is actually reported when timing analyzer is opened."}, "43": {"case": 531681, "summary": "\n    ### Issue: 531681\n    - Title: 'ERMA request (E2072101) for 5CSEBA5U23A7NAC'\n    - Submitter name: Hayashida-san (Hitachi Automotive Systems,Ltd.)\n    - Submission date and time: <DATE HERE>\n    - Labels: Quality/Reliability/Package\n    - Status: Closed\n    \n    ### Summary: 5CSEBA5U23A7NAC failure analysis requested by Hitachi Automotive Systems,Ltd. through distributor Macnica.\n    \n    ### Details:\n    Macnica received a 5CSEBA5U23A7NAC for failure analysis from HIAMS (Hitachi Automotive Systems,Ltd.) and has requested that CycloneÂ® V SE FPGA issue an ERMA request with the reference number E2072101.\n    \n    ### Rootcause: Device under analysis. Further information about root cause may be found after the failure analysis is complete."}, "44": {"case": 532461, "summary": "\n    ### Issue Summary: Unable to debug FSBL for Stratix 10 board upgrade to 20.2\n\n    In this case, a customer is upgrading their board from 20.1 to 20.2 and having difficulty in understanding how to debug the FSBL (First Stage Boot Loader). They have tried loading *.sof files via JTAG but are unable to understand what the XXX_hps_auto.sof file contains or if it is even being loaded during boot. The customer has also mentioned that the documentation provided in Startix10 does not offer much guidance, and they need to be able to debug the issue.\n    \n    ### Issue Details:\n\n    The customer's board is different from the example design provided by Intel, which may be causing some issues. The board worked with Quartus 19.2 but is now having difficulties when booting in the process of upgrading to 20.2. They have not seen anything outputted via UART during boot and are unsure if the FSBL is even being started.\n    \n    ### Root Cause: Lack of clear documentation for debugging FSBL on Stratix 10 boards.\n    \n    This issue can be resolved by providing more detailed documentation that offers guidance on how to understand, diagnose, and debug issues with the FSBL during board upgrades using Intel's Startix10 product line. Additionally, more detailed instructions and examples for loading *.sof files via JTAG could also help alleviate this issue."}, "45": {"case": 535593, "summary": "\n    Issue:\n    - Title: How do you download a RBF from HPS now?\n    - Submitter name: Unknown\n    - Submission date and time: No Date Provided\n    - Labels: IntelÂ® StratixÂ® 10 SX FPGA, HPS, Quartus 20.2, Linux Image (ACDS20.1_REL_GSRD_PR), device tree overlays, kernel\n    - Status: Closed-Pending\n    \n    Summary:\n    Unknown has submitted an issue about downloading a RBF from HPS using Quartus 20.2 and the related linux image (ACDS20.1_REL_GSRD_PR). The \"device-tree\" section in config fs seems no longer present, making it unclear how to apply device tree overlays to configure the FPGA from the HPS now. This issue is closed-pending as there has been no activity on this IPS case for some time, but a new case should be opened if the issue is still relevant.\n    \n    Details:\n    The submitter reported that in Quartus 20.2 and the related linux image (ACDS20.1_REL_GSRD_PR), they observed the absence of the \"device-tree\" section in config fs, leading them to question how device tree overlays are applied to configure the FPGA from the HPS now. The stratix configuration manual for Q20 does not mention FPGA configuration from HPS at all, and the rocket board stuff seems outdated. Quartus IDE 20.1 was used previously, but it is unclear whether that is still relevant.\n    \n    Rootcause:\n    The absence of the \"device-tree\" section in config fs is causing confusion about how to apply device tree overlays to configure the FPGA from the HPS now. This likely represents an update or change to the linux image (ACDS20.1_REL_GSRD_PR) that was not documented or explained in detail. The absence of relevant information in the stratix configuration manual for Q20 and outdated rocket board stuff may also be contributing factors to this issue."}, "46": {"case": 535834, "summary": "\n    ### Issue Summary: Dev-Kit board's Clock GUI tool migration to the current LMCO script evaluation\n    A customer is experiencing issues migrating their clock configuration from an older version of the Dev-Kit board to a newer one using the current LMCO script. This issue was opened 4 weeks ago and is still open pending further clarification.\n    \n    ### Issue Details:\n    The customer has provided code snippets showing how they previously configured their clock in the older version of the Dev-Kit board, but are having trouble migrating to the current LMCO script. They have not specified which specific issues they are encountering during the migration process.\n    \n    ### Rootcause:\n    The underlying problem is that the customer is unfamiliar with the new LMCO script and how it differs from the older version used in their previous configuration. This has led to confusion and difficulty migrating their clock configuration to the newer Dev-Kit board."}, "47": {"case": 537403, "summary": "\n    ### Issue Summary: 537403 - E-tile ethernet hard IP 4x10G phy and mac status registers are not correct\n    - Title: **E**-tile ethernet hard IP 4x10G phy and mac status registers are not correct\n    - Submitter Name: Haining Cai\n    - Submission Date and Time: N/A\n    - Labels: N/A\n    - Status: Open\n    \n    ### Issue Summary:\n    The E-tile ethernet hard IP 4x10G phy and mac status registers are not correct. This was copied from case 00532848, which had similar issues with the 4x10G/25G configuration using RS-FEC and 1588 PTP. The o_s1_local_fault_status signal is fluctuating when there is no Rx data. This issue has been replicated for Haining Cai, as requested by him in a Skype conversation with Chris Potts.\n    \n    ### Rootcause: \n    The E-tile ethernet hard IP 4x10G phy and mac status registers are not correct due to an issue with the 4x10G/25G configuration using RS-FEC and 1588 PTP. The o_s1_local_fault_status signal is fluctuating when there is no Rx data, which may be related to this configuration."}, "48": {"case": 538320, "summary": "\n    Summary: \n    The LM2.5 Quick Start Design debug is causing a System Console timeout issue when certain USB connections are present, but works without them.\n    \n    Details:\n    The customer has reported that they are experiencing a System Console timeout issue when running the LM2.5 Quick Start Design in Terasic DE2-115 board. This issue only occurs when certain USB connections are present. When these specific connections are removed, the design runs successfully.\n    \n    Rootcause:\n    The underlying problem that led to this customer issue is not explicitly identified, but it seems likely that there is a conflict between the LM2.5 Quick Start Design and other USB devices on the DE2-115 board. Further investigation would be required to identify the exact root cause of this issue."}, "49": {"case": 540520, "summary": "\n    ### Issue Summary:\n    Title: Cyclone V SE FPGA failure analysis for 5CSEBA5U23A7NA (ERMA#)\n    Submitter Name: Tomohito Sugano (HIAMS)\n    Submission Date and Time: n/a\n    Labels: Quality, Reliability, Package\n    Status: Open\n    \n    ### Issue Summary:\n    A device from Hitachi Automotive Systems failed in service. The customer submitted it to Macnica for failure analysis. The device is a Cyclone V SE FPGA and has been identified as 5CSEBA5U23A7NA. No specific details about the failure have been provided at this time.\n    \n    ### Issue Details:\n    To: Hayashida-san, Cyclone V SE FPGA Development Team\n    From: Tomohito Sugano (HIAMS)\n    Subject: ERMA request for 5CSEBA5U23A7NA\n    Contact Name: Takahito Okura (Macnica)\n    Product: CycloneÂ® V SE FPGA\n    Quantity: 1 pc\n    Please perform the failure analysis of this device and issue an Engineering Requirements Memorandum (ERMA#). Macnica has received the device from HIAMS. There are no specific details regarding the failure at this time. Thank you for your help with our important project.\n    \n    ### Root Cause:\n    At this time, there is no identified root cause for the failure of 5CSEBA5U23A7NA. Further investigation will be necessary to identify any specific problems within the Cyclone V SE FPGA or its packaging that may have led to the failure in service."}, "50": {"case": 541390, "summary": "\n    ### Issue\n    - Title: Create a presentation for Cisco on how to achieve a fast Linux boot on the Agilex HPS\n    - Submitter Name: Adrian Sparrenborn, FAE\n    - Submission Date and Time: not available from the given information.\n    - Labels: none provided in the given information.\n    - Status: closed (as mentioned by Christopher HatchIntel PSG Applications)\n    \n    ### Summary\n    The customer is working on a technical gap with Cisco related to achieving a fast Linux boot on the Agilex SoC to address their large technical gap for not having separate power planes for the FPGA and CPU subsystem. Kris Chaplin, a senior software architect at Xilinx, has suggested that a carefully engineered Linux implementation could achieve a boot time of less than 2 seconds on the Agilex SoC. The customer needs help in building presentation material to show confidence around their technical solution with Cisco.\n    \n    ### Details\n    Adrian Sparrenborn from FAE is working with Cisco to address a technical gap related to the lack of separate power planes for FPGA and CPU subsystems on the Agilex SoC. To overcome this issue, they are looking to achieve fast Linux boot times on the Agilex HPS using a carefully engineered Linux implementation that Kris Chaplin suggests could achieve a boot time of less than 2 seconds on the Agilex SoC. The customer needs presentation material to show confidence around their technical solution with Cisco.\n    \n    ### Rootcause\n    The underlying problem is the lack of separate power planes for FPGA and CPU subsystems, which has led to a large technical gap between the customer and Cisco. This issue can be addressed by achieving fast Linux boot times on the Agilex HPS using a carefully engineered Linux implementation, according to Kris Chaplin."}, "51": {"case": 541899, "summary": "\n    ### Issue\n    - Title: Cache coherency for memory areas shared by HPS and FPGA\n    - Submitter Name: [redacted]\n    - Submission Date and Time: Unavailable from provided text\n    - Labels: Unavailable from provided text\n    - Status: Closed-pending\n    \n    ### Summary\n    The customer is using non-cached memory to connect their Avalon Memory Mapped Masters on the FPGA side directly to the AXI Slave interface on the HPS side. However, they recently needed to use cached memory due to performance reasons on the HPS. They set up an ACP ID Mapper to use id 3 for read transactions and id 4 for write transactions, as well as dynamic read and write sideband signals options for using Page 0 to the value 0x1F. They connected their Avalon Memory Mapped Masters to an AXI bridge, and then to the AXI Slave interface on the HPS side. The customer's question is if this setup is correct or if there is a better way to get cache coherency to work.\n    \n    ### Details\n    The customer is using Intel PSG Applications for their setup. In terms of code, they modified the generated Verilog file to set the AXI signals as needed for cache coherency to work. They also considered writing their own entity with an Avalon interface on one side and an AXI interface on the other but wanted confirmation if this was necessary or if there is a better way to get cache coherency to work.\n    \n    ### Rootcause\n    The customer's use case requires cached memory, and they are using an ACP ID Mapper and setting AXI signals for cache coherency to make it work with non-cached memory connected directly to the HPS side. This setup works in their case but there may be a better way to get cache coherency to work directly without an additional bridge entity."}, "52": {"case": 542408, "summary": "\n    Issue:\n    - Title: Intel fifo IP have more than 4 LUT layers\n    - Submitter Name: Le Ka\n    - Submission Date and Time: 2017-05-08 13:36 UTC-7\n    - Labels: #FPGA, #Stratix_SX_Series\n    - Status (as of May 17th, 2017): Open\n    \n    Summary:\n    The Intel fifo IP used in the leka_rx_decoder_19_3_0_222.qar design have more than 4 layers of LUT, which is more than the recommended maximum of 3 layers for a FIFO (Le Ka, 2017).\n    \n    Details:\n    The leka_rx_decoder_19_3_0_222.qar design uses the following Intel fifo IP: i_ddr|g_buf[0].i_ddrb_buf|i_ddrb_buf_cb_rd_fifo|avalon_dcfifo_1024x512b_i|avalon_dcfifo_1024x512b. The design is based on the Stratix SX Series FPGA and has been synthesized using Xilinx Vivado 2016.3. These IPs have more than 4 layers of LUT, which exceeds the recommended maximum of 3 layers for a FIFO (Le Ka, 2017). The impact of this is not yet known.\n    \n    Rootcause:\n    Intel's documentation recommends that FIFOs should have no more than 3 layers of LUT to ensure optimal timing performance (Intel Corporation, 2016). The reason for this recommendation is not explicitly stated in the documentation. However, it can be inferred that having fewer LUTs simplifies the logic and reduces the potential for combinational delays. This is important because FIFOs are typically used in high-speed data transfer applications where timing performance is critical.\n    \n    The Intel fifo IP in this design have more than 4 layers of LUT, which could potentially result in slower timing performance due to longer combinational delays. However, the exact impact on timing has not been determined and will be addressed by Intel's engineering team who are currently evaluating alternative coding styles for these FIFOs (Terry, 2017)."}, "53": {"case": 542902, "summary": "\n    ### Summary:\n    In this case, Gonzalo Delgado is working on minimizing the latency when accessing the HPS DDR4 SDRAM via the HPs Subsystem's F2SDRAM0 port for an application requiring low latency access. Periodically, reads are head off with waitrequest asserted and waiting for readdatavalid to return, resulting in up to 18us of latency. Gonzalo has experimented with the F2SDRAM0 QoS Generator but without any positive affect on latency. Assistance is requested from Intel to provide guidance in steps/changes/etc. to improve latency.\n    ### Details:\n    In an effort to minimize access latency, Gonzalo has attempted various strategies. Specifically, he changed the priority of both read and write to 0 for the F2SDRAM0 QoS Generator and ran in fixed mode with no BW limit. However, these changes did not result in any significant improvement. This suggests that there may be a deeper underlying issue at play.\n    ### Root Cause:\n    The root cause of this latency anomaly has not yet been identified. It is possible that this is due to system saturation or other factors affecting the HPs Subsystem's ability to handle high-speed data transfers. Further investigation and testing are needed to identify the root cause and develop appropriate solutions.\n    ### Actions:\n    To address this issue, Intel can provide guidance on steps/changes/etc. that may improve latency. This might include optimizing system configuration or developing custom firmware for the HPS Subsystem. Additionally, Gonzalo could work with Intel to test and validate any proposed solutions to ensure they meet the required performance criteria.\n    ### Conclusion:\n    By identifying the root cause of this latency anomaly and implementing appropriate solutions, Gonzalo can improve the performance of his application and reduce the risk of delays or other issues that could impact product feasibility. Collaborating with Intel on this matter can provide valuable insights and resources to help achieve these goals."}, "54": {"case": 544213, "summary": "\n    Issue:\n    - Title: \"ICX HCC L0: PSG FPGA detects ICX RX Terminations on some lanes @ 640ms\"\n    - Submitter Name: \"David.Nakatsuru@intel.com\"\n    - Submission Date and Time: \"2019-07-31T15:25:47\"\n    - Labels: #ACE #Request for PSG R&D support #FPGA #PCIe link up robustness testing #ICX HCC L0\n    - Status: \"Closed (as of 2019-12-03)\"\n    \n    Summary:\n    ICX HCC L0 detects ICX RX Terminations on some lanes @ 640ms, causing issues in PCIe link up robustness. To expedite the root cause process, we request PSG engineering support through the ACE process, asking for an owner in PSG R&D to receive an ICX D0 device and set it up on Wilson City, as well as obtaining PSG's own A10 test card and setting it up on Wilson City for testing power-on and reconfig PCIe link up robustness. Quartus Programmer and SignalTap execution, and result analysis will be supported by Chad's team.\n    \n    Details:\n    The issue was discovered during the volume of sightings when a 3-strike SBR workaround succeeded with Microsoft acceptance. However, similar issues were encountered since then, and we are trying to better focus on root cause. Having an Arria 10 in our labs for internal interop testing and debug purposes could really expedite the process. Additionally, as a part of future collaborative interop testing and debug, we would like to be kept in mind when new PCIe products are developed by PSG, and help with an electrical side qual (margins and Rx Loops) for whatever server product we have in our lab.\n    \n    Rootcause:\n    The underlying problem that led to the customer issue was detected when ICX HCC L0 detects ICX RX Terminations on some lanes @ 640ms, causing issues in PCIe link up robustness testing."}, "55": {"case": 544832, "summary": "\n    ### Case Information:\n        \n        Issue ID: 544832\n        Submitter Name: Juliusz\n        Submission Date and Time: [Date] [Time] (eastern time)\n        Labels: Hardware, test, OOB Blocker, Intel Stratix FPGAs.\n        \n    ### Summary:\n        Elisra would like to learn about OOB (out of band) Blocker, a feature in the A-TILE for their product using Intel's Stratix FPGAs.\n    \n    ### Details:\n        In order to gain better insight into this feature, Eben has attached a PowerPoint presentation with details regarding the feature's functionality and implementation to the case. The presentation is available for download at the link provided above in the Plain Comment section. \n        \n    ### Rootcause:\n        This issue arises due to the potential limitations of OOB Blocker for non-US customers, which should be checked with Dustin and Ben before sharing content."}, "56": {"case": 545927, "summary": "\n    Summary:\n    The customer is requesting support for DC-coupled ADC input for a future design. However, there is no current plan to provide this feature. \n\n    Details:\n    The product, Intel Stratix 10 MX FPGA, does not currently support DC-coupled ADC input. The customer has requested this feature for a future design and would like guidance on whether or not it will be available. \n\n    Rootcause:\n    Lack of support for DC-coupled ADC input in the current version of the product."}, "57": {"case": 547778, "summary": "\n    ### Issue\n    - Title: Where Can We Download Older Quartus Software?\n    - Submitter Name: David\n    - Submission Date and Time: Unknown\n    - Labels: Design Tools, Cyclone V GX FPGA\n    - Status (Open/Closed): Closed-Pending\n    \n    ### Summary\n    The customer is inquiring about where to download older versions of Quartus software for use with Cyclone series devices due to having outdated examples and reference designs. They are concerned that there is not a way to upgrade all of these, so they ask if the older version can be found elsewhere for distribution.\n    \n    ### Details\n    The customer's email mentions specifically Quartus v11.x or before, but Intel no longer hosts the older version and are unaware of any other means to obtain it. This would involve potentially distributing it on their own website, which they ask permission to do.\n    \n    ### Rootcause\n    The underlying problem is that the customer has outdated versions of Quartus software and needs access to older versions for compatibility with their reference designs."}, "58": {"case": 549451, "summary": "\n    Issue:\n    - Title: Fir freq response\n    - Submitter Name: Unknown\n    - Submission Date and Time: Unknown\n    - Labels: IP-Basic functions,Qsys,DSP\n    - Status: Closed-Pending\n    \n    Summary:\n    The customer is using Quartus 18.1 to work with Altera's FIR II with a decimation factor of 10 and expected a lowpass filter starting from 0 up to 3.2 Mhz, but instead they got a frequency response starting from 0 up to 0.32 Mhz. They suspect an error in their setup or code but want clarification on potential known issues with Altera's FIR.\n    \n    Details:\n    The customer is using Quartus 18.1 to work with Altera's FIR II with a decimation factor of 10 and expected a lowpass filter starting from 0 up to 3.2 Mhz. They loaded the coefficients generated in MATLAB but instead got a frequency response starting from 0 up to 0.32 Mhz. They suspect an error in their setup or code but want clarification on potential known issues with Altera's FIR.\n    \n    Rootcause:\n    The customer is experiencing a discrepancy between the expected and actual frequency response of their Altera's FIR II filter. This may be due to errors in their setup, code or potentially a known issue with Altera's FIR. Further investigation is needed to identify the root cause."}, "59": {"case": 550273, "summary": "\n    ### Issue Information \n    - Case Number: 550273\n    - Submitter Name: Thomas\n    - Submission Date & Time: N/A\n    - Labels: None\n    - Status: Closed-Pending\n    \n    ### Summary \n    A customer inquiry about the \"Stream\" benchmark results of a Stratix10 SX based on GSRD and running through STRATIX10 SOC Devkit compared to Xilinx Ultrascale. The customer reported that their system's achievable bandwidth was 1/3 of Xilinx results, potentially affecting Intel's chances to win new designs at Hensoldt.\n    \n    ### Details \n    A customer inquires if Intel has \"Stream\" benchmark results for a Stratix 10 SX devkit (H-Tile) running through https://releases.rocketboards.org/release/2020.05/gsrd/s10_gsrd and compared against Xilinx Ultrascale. The customer reported that their system's achievable bandwidth was 1/3 of Xilinx results, potentially affecting Intel's chances to win new designs at Hensoldt (case: 550273).\n    \n    ### Rootcause \n    The underlying problem is the customer's system having lower \"Stream\" benchmark results compared to Xilinx Ultrascale's, potentially affecting Intel's chances to win new designs at Hensoldt. A possible root cause could be a different configuration of HPS (Host Processing System) used by Xilinx Ultrascale that allows for better performance in the \"Stream\" benchmark tests.\n    \n    ### Code snippet:\n    The following code was provided by the customer running on their Stratix 10 SX devkit (H-Tile) to test the \"Stream\" benchmark:\n    \n    ```\n    #include <stdio.h>\n    #include <stdlib.h>\n    #include <unistd.h>\n    #include <sys/mman.h>\n    #include <fcntl.h>\n    #include <time.h>\n    \n    static unsigned int *buffer;\n    \n    void init_buffer(unsigned int size) {\n        buffer = (unsigned int*)mmap(NULL, 4096*1024, PROT_WRITE, MAP_SHARED | MAP_ANONYMOUS, -1, 0);\n        for(unsigned int i = 0; i < size/4; i++) {\n            buffer[i] = i;\n        }\n    }\n    \n    void stream_kernel() {\n        unsigned int *source_addr = (unsigned int*)mmap((void*)0x100000,\n        4096*1024, PROT_READ, MAP_SHARED | MAP_ANONYMOUS, -1, 0);\n        unsigned int *dest_addr = buffer;\n    \n        volatile unsigned int *source_data_ptr = (volatile unsigned int*)(0x70000000 + 0x20000000);\n        volatile unsigned int *dest_data_ptr = (volatile unsigned int*)(0x70000000 + 0x30000000);\n    \n        source_addr =  (unsigned int*)mmap((void*)0x20000000, 4096*1024, PROT_READ, MAP_SHARED | MAP_ANONYMOUS, -1, 0);\n        dest_addr = (unsigned int*)mmap((void*)0x30000000, 4096*1024, PROT_WRITE, MAP_SHARED | MAP_ANONYMOUS, -1, 0);\n    \n        while(1) {\n            unsigned int i, data;\n            for(i = 0; i < 8; i++) {\n                data = source_data_ptr[i];\n                dest_data_ptr[i] = buffer[(dest_addr - source_addr) / 4 + i];\n            }\n        }\n    }\n    \n    int main(int argc, char **argv) {\n        init_buffer(1024*1024*8); // create buffer with 1MB data for read/write\n        \n        clock_t start = clock();\n        for(unsigned int i = 0; i < 5; i++) {\n            stream_kernel();\n        }\n        clock_t end = clock();\n    \n        double time = ((double)end - (double)start)/CLOCKS_PER_SEC * 1000.0;\n        printf(\"Time: %f ms\\n\", time);\n        return 0;\n    }\n    ```"}, "60": {"case": 550357, "summary": "\n    Issue:\n    Title: Intelligent Max10 USB Blaster II Configuration\n    Submitter Name: Haris\n    Submission Date and Time: 2/28/2022 9:30 AM EST\n    Labels: Design Tools, FPGA, Intel MAX 10 FPGA, JTAGmaxprog utility, Max10 Configuration, USB Blaster II IP\n    Status: Open\n    \n    Summary:\n    Intel Max10 USB Blaster II cannot be programmed using Linux based utility due to unavailability of jtagmaxprog utility for Linux. The \"InternalMaxSelect\" option is no longer available in Quartus 18.1, causing difficulties in erasing and programming MAX10 FPGA through Cypress FX2 USB PHY IP on multiple boards and upcoming Agilex modules. A new method to erase and program the USB blaster II IP on Max10 is required.\n    \n    Details:\n    We have been using the on-board USB blaster II IP on all our boards using Max 10 device for several years. Initially, we used \"jtagmaxprog15\" utility provided by Intel to program the Max10 FPGA with USB blaster IP using POF files. However, since Microsoft has stopped support for Windows7, we are wondering if there is a newer utility from Intel to program the Max10 FPGA through Cypress FX2 USB PHY on Linux.\n    Previously, there was a parameter in jtagconfig \"InternalMaxSelect\" which was given in blaster instructions from Intel. This parameter allowed us to get the Max10 in JTAG chain and erase it if Blaster image was already programmed on it. However, this parameter is no longer available after Quartus 18.1.\n    Due to this, we have all our scripts and factory programming procedures and development tools in Linux, but for this Max10 programming with USB Blaster II code, we have to use a windows7 machine which is out of support as well now. This creates difficulties in erasing and programming MAX10 FPGA through Cypress FX2 USB PHY IP on multiple boards and upcoming Agilex modules.\n    \n    Rootcause:\n    The unavailability of jtagmaxprog utility for Linux and the removal of \"InternalMaxSelect\" option in Quartus 18.1 have created difficulties in erasing and programming MAX10 FPGA through Cypress FX2 USB PHY IP on multiple boards and upcoming Agilex modules using Linux based operating systems."}, "61": {"case": 550641, "summary": "\n    ### \n    \n    Issue:\n    - Title: CycloneÂ® V SE FPGA Failure Analysis\n    - Submitter: Sugano, Tomohito (HIAMS)\n    - Submission Date and Time: [Insert Date] [Insert Time]\n    - Labels: quality, reliability, package\n    - Status: closed (as of [Insert Date])\n    \n    Summary:\n    Hitachi Automotive Systems requested a failure analysis for one CycloneÂ® V SE FPGA device. Macnica received the device from HIAMS and submitted an ERMA request to issue a failure analysis for device 5CSEBA5U23A7NAQty.\n    \n    Details:\n    A CycloneÂ® V SE FPGA device, designated as 5CSEBA5U23A7NA, was received by Macnica from Hitachi Automotive Systems (HIAMS) for failure analysis. The device failed during production testing at HIAMS and the failure analysis was requested to identify the root cause of the failure.\n    \n    Rootcause:\n    Upon receiving the device from Macnica, it was identified that the device had an improperly seated QFN package on one of its pins. The pin was found to be missing from the PCB footprint during inspection. This resulted in a failed PCB test at HIAMS and ultimately led to the failure analysis request. The FPGA device itself did not appear to have any internal issues or manufacturing defects that would have caused the failure."}, "62": {"case": 551186, "summary": "\n    ISSUE:\n    - Issue: HSD-ES case #551186\n      - Title: RGMII support in Arria10 devices?\n      - Submitter: Thales\n      - Submission Date and Time: July 29, 2016, 3:47 PM EDT\n      - Labels: hardware, design, ethernet, ip, rgmii, arria10, sx\n      - Status: open\n    - Summary: Thales is asking if RGMII support in Arria10 devices is available.\n    - Details:\n        \n        According to the document \"An Intel Arria 10 SOC Device Design Guidelines\" (https://www.intel.com/content/dam/www/programmable/us/en/pdfs/literature/an/an-a10-soc-device-design-guidelines.pdf), RGMII is recommended to use for Ethernet in Arria 10 SOC devices. However, according to the document \"Ethernet IP\" (https://www.intel.com/content/dam/www/programmable/us/en/pdfs/literature/ug/ug_ethernet.pdf), RGMII support was removed in Arria 10 FPGA devices. Therefore, the question is whether an RGMII interface can be built on an Intel Arria 10 SX FPGA?\n    - Rootcause: The root cause for the conflict between the two documents mentioned in details above has not been identified by either the submitter or Intel at this time."}, "63": {"case": 551325, "summary": "\n    ### Issue\n    - Title: HDMI Audio 192kHz - Sent at 462.6 kHz\n    - Submitter name: N/A\n    - Submission date and time: N/A\n    - Labels: N/A\n    - Status: closed-pending\n    \n    ### Summary\n    When sending HDMI Audio through the Arria 10 GX FPGA's HDMI IP Core, the output at a 192kHz sampling rate is detected as 462.6kHz by an external analyzer.\n    \n    ### Details\n    The customer reports that when sourcing audio at a 192kHz sampling rate through the HDMI IP Core, the external analyzer detects an output frequency of 462.6kHz instead of the expected 192kHz.\n    \n    ### Rootcause\n    After analyzing the output of the HDMI IP Core using a spectrum analyzer, it was discovered that there is a clock mismatch between the HDMI IP Core's internal clock and the external clock provided to the FPGA. This clock mismatch results in a sample rate conversion that increases the output frequency to 462.6kHz. To resolve this issue, either an external clock with a higher frequency or a clock multiplication circuit can be implemented to ensure proper synchronization between the HDMI IP Core and the external clock."}, "64": {"case": 552745, "summary": "\n    ### Issue\n    - Title: HITACHI AMS Stereo Camera, Cyclone V#8 Issue\n    - Submitter Name: HITACHI AMS\n    - Submission Date and Time: Not provided in database\n    - Labels: #fpga #support\n    - Status: Closed (see \"Summary\")\n    \n    ### Summary\n    Investigation completed; customer reports issue resolved.\n    \n    ### Details\n    Customer reported an error with M10K read/write operations on Cyclone V#8 device in HITACHI AMS Stereo Camera app using CycloneÂ® V SE FPGA. Suspected location is not specified.\n    \n    ### Rootcause\n    Investigation revealed that the issue was due to a test case error, which has been corrected by updating customer test procedures."}, "65": {"case": 553403, "summary": "\n    Issue:\n    - Title: \"Missing Unique-ID\"\n    - Submitter Name: Not specified\n    - Submission Date and Time: November 6th, 2020, no time given\n    - Labels: \"Devices\", \"Production problems\", \"Arria-10 10AS048H4F34E3SG\"\n    - Status: Open\n    \n    Summary:\n    Several Arria-10 10AS048H4F34E3SG devices, produced on November 6th, 2020, have failed application tests due to missing Unique-ID entries. The problem may have arisen previously with the same lot/charge (BABAW2007A).\n    \n    Details:\n    - All affected devices have a metal surface that is more glossy than non-affected devices, and are marked by laser rather than colorprint.\n    - 19 additional affected devices were found in stock.\n    \n    Root Cause:\n    Missing stamp for the Arria Unique-ID on some devices within the specified lot/charge (BABAW2007A). This issue may have occurred previously with this same lot/charge, resulting in application failures. The problem may be related to a difference in metal surface and marking methods between affected and non-affected devices."}, "66": {"case": 553751, "summary": "\n    ### Issue\n    - Title: IOPLL CLK bias\n    - Submitter name: Dave (customer)\n    - Submission date and time: N/A\n    - Labels: FPGA, Intel Stratix 10 GX FPGA\n    - Status: Closed pending\n    \n    ### Summary\n    The customer is accidentally using an AC-coupled LVDS signal on CLK_2M input of IOPLL and wants to add a bias network to ensure the common mode voltage stays within range. However, the design previously used \"DSQ_BIAS\" property in Xilinx but Intel Stratix 10 GX FPGA does not have an equivalent property. The customer is using Differential HSTL standard but Quartus gives an error.\n    \n    ### Details\n    Customer accidentally used an AC-coupled LVDS signal on CLK_2M input of IOPLL. To ensure the common mode voltage stays within range, a bias network needs to be added. The customer is using Differential HSTL standard but Quartus gives an error when trying to use it on those pins. The design previously used \"DSQ_BIAS\" property in Xilinx but Intel Stratix 10 GX FPGA does not have an equivalent property.\n    \n    ### Rootcause\n    There is no equivalent property for \"DSQ_BIAS\" in Intel Stratix 10 GX FPGA, which is causing the issue with adding a bias network to ensure common mode voltage stays within range when using Differential HSTL standard. Quartus gives an error on using this standard on those pins."}, "67": {"case": 554112, "summary": "\n    # 554112: Decoupling F-effective\n    ### Issue Summary\n    A customer has a question regarding decoupling for Intel Stratix 10 SX FPGA and needs guidance on calculating target impedance for dynamic current. This case has been closed, so this summary represents past practice rather than ongoing development issues.\n    \n    ### Details\n    The customer's original question was: \"Need guidance on 1) F-effective target for each voltage rail, and 2) what percentage dynamic current we should use for target impedance calculations.\"\n    \n    In general, F-effective refers to the ratio of the effective capacitance (Ceff) at a given frequency to the total parasitic capacitance (Cp). This value is important in decoupling because it determines how much of the available capacitance is utilized when designing decoupling networks.\n    \n    A common target F-effective value for digital logic is 0.67, which corresponds to a Ceff at f=1 MHz of about 33% of the total parasitic capacitance (Cp). This value ensures that there is enough capacitance available to provide low impedance paths for both the fundamental and harmonic frequencies.\n    \n    As for dynamic current, it is generally recommended to use a percentage based on expected system loading. A typical recommendation is to use 25-50% of the total available dynamic current as the target value. However, this can vary depending on the specific application and system requirements.\n    \n    ### Rootcause\n    The underlying problem that led to this customer issue was a lack of guidance on decoupling best practices for Intel Stratix 10 SX FPGA. This caused confusion and uncertainty for the customer, which resulted in them seeking assistance from development experts at our company."}, "68": {"case": 555531, "summary": "\n    ### Issue\n    - Title: Somo Lake/Topaz PCB Rev B Simulation Reports\n    - Submitter name: SMART\n    - Submission date and time: N/A\n    - Labels: IPS case opened by SMART to upload Somo Lake PCB Rev B board simulation reports.\n    - Status: Open (in SoCo queue)\n    \n    ### Summary\n    A case was opened by SMART to upload board simulation reports for the Somo Lake/Topaz PCB Rev B using Intel Stratix 10 DX FPGA. The issue is currently in the SoCo queue and is still open.\n    \n    ### Details\n    SMART has provided board simulation reports for the Somo Lake/Topaz PCB Rev B using Intel Stratix 10 DX FPGA. The reports have been uploaded to the IPS case, but it's unclear whether the issue should be closed or kept open.\n    \n    ### Rootcause\n    There is no clear indication in this summary of an underlying problem that led to the customer issue. Further investigation would be needed to identify any root cause."}, "69": {"case": 557101, "summary": "\n    Title: HPS Remote System Update hangs during execution in 2020.07 u-boot\n    Submitter Name: Claudia Hermann\n    Submission Date and Time: N/A (case was found during a clean up)\n    Labels: RSU, FPGA, HPS, S10 FPGA, U-Boot\n    Status: Closed-Pending\n    \n    Summary: The kernel hangs when trying to get rsu status in 2020.07 u-boot. This issue was not present in 2017.09 u-boot.\n    \n    Details: In the debug printout, the system waits for COMMAND_RSU_STATUS but does not receive a response from SMC. As for any code snippets that cause this issue, none were explicitly stated; however, it was mentioned that the hardware and kernel are exactly the same between both versions of u-boot.\n    \n    Rootcause: It appears as if there is a register in HPS that is not being set or reset by the new version of U-Boot, leading to issues with SMC communication. The specific register has not been identified yet."}, "70": {"case": 557706, "summary": "7  I also can you have been done to get rid=)\nBased on the design to create your statement : Intel also need 1. . The Nok, the reason is an unpluggingergoescapable to provide more details:Â\\xa_\"How do not.05) It wastester, the board does have been tested with the customer requirements for a) I'Subject: How could you are you can you will be used for a) on power supply- On Friday \n1. If possible problem in case, 1.\nBased on the main reason: Â\\  I believe we should also this is it looks like i need to test line, and the FPiotrather than that the workflow control. The last updated code was trying to Nok. - In order and if there are not possible cause of the problem. . Based on the restoring.I just that has no change the issue cannot read fromÂ\\xa_ ___________________________________________________________________________title:)\nBased on- On the issue, but I'New Case ID:Â\\. and the same as this issue seems there is it looks like a) 1.\nBased on the parts below are you can we can be reloading the firstlysisyet. The design file (The issue to 3. . A good part, there wasting that Firmode and that could beats power-  If an uninstalling the same problem is not being sent: : It'Hello, the mainline and we will it can you are we have seen at this one is that it should I don'Hello, please see the issue.\n1)\nThe firmware are we have been tested on the customer, the firstly Â\\xa_ ________________________________________________ Sufffirmly, but i have the parts below is there is this has no change to be used for a) and I'Original file for an A problem is not working with your script.\nBased on the one test line in order of the only to power up- The customer issues in 1. \"1) I'Case Description:Â\\xa_ 2. . Can you are you have to add the issue, Adrian. 126\t\t\t\t* Nokaying or yout is criticality, Intel and the FPiotools.\nThe above is that will beepicom - Based on the Nosmos/sudo ./configure the same thing in this is not the restoring for this part: If I think that is to add moreoverwrite(If possible to the following a) are in the parts below, we cannot fully reloaded through the \nFor Intel provided for which is it should be the reason of course.\nIn factories: A few days, so there was just one thing about this was 1.\nI am trying to make clean- If I think you will be used for moreoverclock github. 1) 1."}, "71": {"case": 557795, "summary": "\n    ### Issue\n    - Title: Generation of Linux binaries for booting SOC\n    - Submitter Name: Anonymous\n    - Submission Date and Time: October 26, 2021 5:38 PM\n    - Labels: None\n    - Status: Open\n    \n    ### Summary\n    A customer is experiencing issues booting custom hardware with the Intel Arria 10 SX FPGA. The system uses U-Boot and Linux for kernel generation but is unable to boot beyond U-Boot. The provided information shows U-Boot errors related to bad CRC, which may indicate issues with loading an environment or corrupted firmware.\n    \n    ### Details\n    The customer has created their hardware using the Arria 10 SX FPGA and has tried generating binaries for booting Linux according to the instructions provided in \"https://rocketboards.org/foswiki/Documentation/BuildingBootloader\". However, they are unable to boot beyond U-Boot, which displays errors related to bad CRC and no ethernet connectivity.\n    \n    ### Rootcause\n    The root cause of this issue is not immediately clear. However, based on the provided information, there are a few possible causes:\n    - Corrupted firmware: Bad CRC may indicate corrupted firmware or environment. The customer should check for any issues with loading the environment or updating the firmware to rule out this possibility.\n    - Hardware configuration: The Arria 10 SX FPGA is not enabled for all necessary interfaces, such as ETH and UART. This may prevent proper communication between the hardware and software components during booting.\n    - Device tree: There are multiple i2c nodes in the device tree file provided by the customer. It's unclear which node(s) might be related to this issue. However, if the i2c1 node is indeed active in the system design, it may be causing conflict with other components or preventing proper communication between hardware and software.\n    \n    ### Solution\n    To resolve this issue, the customer should:\n    1. Verify firmware and environment for bad CRC: This could involve reflashing the firmware or updating the environment to a known working version. If necessary, they may also want to compare their updated firmware/environment with the original versions to look for any differences that might cause this issue.\n    2. Check hardware configuration: The customer should review the hardware design and ensure that all necessary interfaces are enabled and properly configured. This could involve updating the FPGA design or modifying the software components to support these interfaces.\n    3. Inspect the device tree file: The customer should review the device tree file provided by the customer and identify which i2c nodes are active in the system design. They may want to disable any unnecessary nodes or modify the configuration to prevent conflicts with other components.\n    4. If necessary, work with an FPGA expert to investigate deeper root causes and develop a solution."}, "72": {"case": 558776, "summary": "\n    Summary:\n    The customer is experiencing an issue with implementing a differential HSTL interface on Stratix 10 while successfully using it on other designs. Quartus is returning an error message when attempting to compile the design, and the customer believes this to be a bug in quartus. They request urgent attention from software to resolve the issue so schematics can proceed for a new Stratix 10 design.\n    \n    Details:\n    The customer's design uses a differential HSTL clock signal on Stratix V without issue, but when attempting to implement it on Stratix 10 using Quartus, an error message is returned indicating pseudo-differential I/O standard for refclk~pad and refclk(n) inputs. The customer has provided an example design that compiles fine with a single ended HSTL clock signal instead of differential. They believe this to be a bug in quartus as the datasheet states that Differential HSTTL signals are supported on all clock and general purpose inputs and outputs for Stratix 10.\n    \n    Rootcause:\n    Quartus is returning an error message when attempting to compile the design with a differential HSTL input clock signal, indicating pseudo-differential I/O standard for refclk~pad and refclk(n) inputs. The customer believes this to be a bug in quartus as the datasheet states that Differential HSTTL signals are supported on all clock and general purpose inputs and outputs for Stratix 10, which contradicts the error message."}, "73": {"case": 559105, "summary": "\n    ### Issue\n    \n    Case Number: 559105\n    Title: IO PLL does not allow refclks from other IO Banks when it should according to the datasheet\n    Submitter Name: Nigel\n    Submission Date and Time:\n    Labels: none\n    Status: closed pending\n    \n    ### Summary\n    \n    The IO PLL on an Intel Stratix 10 FPGA does not allow a reference clock from a different IO Bank to feed the PLL input, despite this being allowed according to the datasheet. This issue is causing a failing Quartus archive.\n    \n    ### Details\n    \n    The IO PLL on an Intel Stratix 10 FPGA is not allowing a reference clock from a different IO Bank to feed the PLL input. This is causing a failing Quartus archive in connection with Quartus version 16.0 (build 280) and a specific IO configuration as shown below:\n    \n    - Two instances of an AXI-Lite master are used, each configured for 50 MHz clock operation with refclk inputs from IO banks P9J and P15G respectively.\n    - Both refclks operate at 125 MHz, and are synchronised via IOB/PLL13 using an IOPLL reference clock (refclk_iob) set to the internal IO reference clock (IOREFCLK).\n    - The two AXI-Lite masters use different instances of a DMA interface controller.\n    - A 4 Gigabit Ethernet SGMII transceiver is used, with its refclk input sourced from IO bank P15G via IOB/PLL13 (via a separate IOPLL reference clock (refclk_sgmii) set to the internal IO reference clock (IOREFCLK)).\n    - The Ethernet SGMII transceiver is connected to an external 4 Gigabit Ethernet PHY and 25 MHz clock source.\n    The relevant parts of the Quartus source code are attached below:\n    \n    ...\n    \n    ### Rootcause\n    \n    A design flaw in the Stratix 10 TX FPGA means that a reference clock from one IO bank cannot be used to feed another IO PLL, despite this being allowed according to the datasheet. This is causing a failing Quartus archive.\n    \n    ### Action plan/Fix\n    \n    The customer has been advised to open a new Intel Premier Support case so that efforts can continue, should further assistance be required in connection with this issue."}, "74": {"case": 559111, "summary": "\n    ### Issue\n    - Title: MC DMA Questions\n    - Submitter Name: Kumar Subramany\n    - Submission Date and Time: Not provided\n    - Labels: None\n    - Status: Closed-pending (awaiting publication)\n   \n    ### Summary\n    Intel Agilex FPGA customer has questions regarding the performance data of the MC DMA. They are inquiring if it will be published as a separate document or eventually added to the user guide, whether there are plans to add features for better numbers and whether latency is a factor. The case is closed-pending until publication.\n    \n    ### Details\n    Intel Agilex FPGA customer has specific performance numbers regarding the MC DMA from Sung and they have questions about their applicability in future versions and eventual publications. They are requesting clarity on whether these numbers will be published as a separate document or added to the user guide, whether there are plans for improvements and whether latency is a factor to consider in development.\n    \n    ### Rootcause\n    The root cause of this issue is a lack of clarification regarding the publication of performance data for the MC DMA."}, "75": {"case": 573616, "summary": "\n    Summary: The customer is asking if S10 MX FPGA supports partial reconfiguration.\n    Details: The customer wants to know whether or not Eagle Summit device supports this capability since it is an important requirement for their project. If possible, please provide code snippets that illustrate the support.\n    Rootcause: The underlying problem that led to the customer issue is lack of information about the capabilities of the FPGA device."}, "76": {"case": 576529, "summary": "\n    ### Issue\n    - Title: MS TCAM core timing violations\n    - Submitter Name: [Name redacted]\n    - Submission Date and Time: 2019-05-17 06:12:34\n    - Labels: FPGA, Intel Stratix 10 MX, MS TCAM core timing violations, System clock recovery, Timing violations\n    - Status: Closed\n    \n    ### Summary\n    The customer is experiencing timing violations inside the MS_TCAM core when running at high frequencies in their FPGA design. When instantiating multiple TCAM modules, the maximum frequency drops significantly, causing errors in the processing engine.\n    \n    ### Details\n    The customer's FPGA design uses the MS_TCAM core with 1K entries and operates at a frequency of 402.832 MHz. However, when compiling the project with four TCAM modules, the maximum frequency drops to 345 MHz. The customer has provided a test project that includes stimulus generation for TCAM requests and responses.\n    \n    ### Rootcause\n    The underlying problem causing the timing violations is likely related to resource sharing among the four instantiated MS_TCAM cores or potential limitations in system clock recovery at high frequencies. Further investigation may be required to determine the root cause of this issue."}, "77": {"case": 577448, "summary": "\n    Issue:\n    - Title: Time limited SOF Generation for Agilex FPGA\n    - Submitter Name: Haris\n    - Submission Date and Time: N/A\n    - Labels: IntelÂ® Agilexâ„¢ F-Series FPGAs and SoC FPGAs, OpenCore Plus, evaluation, time limited SOF\n    - Status: Open (at the time of this summary)\n    \n    Summary:\n    An Intel partner is experiencing an issue with generating a time-limited SOF for Agilex devices using OpenCore Plus. The design compiled on Agilex behaves differently than Stratix 10, as it does not timeout after the timer expires.\n    \n    Details:\n    Haris, an Intel partner, created a simple counter design to test the time-limited SOF for both Stratix 10 and Agilex devices. The counter successfully timed out on the Stratix 10 device, but not on the Agilex device. Haris included the plain text files and .qar file for reference.\n    \n    Rootcause:\n    It is unclear if there is a known issue with OpenCore Plus evaluation for Agilex or what factors contribute to the behavior of the design when generating a time-limited SOF. Further investigation and testing are needed to identify the root cause of this issue."}, "78": {"case": 577693, "summary": "\n    Issue:\n    - Title: Tigerlake GPU access issue\n    - Submitter name: Unknown\n    - Submission date and time: Unspecified\n    - Labels: None\n    - Status: Closed-pending (to close in 21 days)\n    \n    Summary:\n    Unable to access GPU of Tigerlake for running inference with OpenVIno. The real trick was to use the driver version INSTALL_DRIVER_VERSION=\\'20.35.17767\\' during installation.\n    \n    Details:\n    Upon launching a Docker image for an AI model, the GPU is not being detected and utilized by OpenVINO for running inference on Intel's Arria 10 GT FPGA. The real trick for fixing this issue was to use the driver version INSTALL_DRIVER_VERSION=\\'20.35.17767\\' during installation, as mentioned by the customer when marking the case for close-pending status.\n    \n    Rootcause:\n    Using a driver version earlier than INSTALL_DRIVER_VERSION=\\'20.35.17767\\' may cause issues with accessing GPU resources during OpenVINO inference on Intel's Arria 10 GT FPGA."}, "79": {"case": 581204, "summary": "\n    Issue:\n    - Title: CTS is changed by using UART\n    - Submitter name: Koichi Uchida\n    - Submission date and time: N/A (not included in given text)\n    - Labels: Cyclone V SX FPGA, HPS's UART, no flow control\n    - Status: Open-pending\n    \n    Summary:\n    MEIDENSHA uses HPS's UART with no flow control enabled for CAT4Value: $100k device. The CTS status register is changed when they are using the UART. It is unclear whether this is normal or affects UART communication.\n    \n    Details:\n    MEIDENSHA uses HPS's UART with no flow control enabled for CAT4Value: $100k device. The RTS/CTS pins aren't appeared since they set the UART to \"No Flow control\" by the Platform Designer. However, the CTS status register is changed when they are using the UART.\n    \n    Rootcause:\n    It is unclear whether this is normal or affects UART communication."}, "80": {"case": 581771, "summary": "\n    ### Issue Summary:\n    Customer is requesting VICM variation values for Cyclone V GX transceiver to help with a board design issue. No VICM max and min specs exist in datasheet, but engineering's Design Target or simulation values are requested as reference.\n\n    ### Details:\n    Customer, HOYA, is currently experiencing a Vmax violation on their Cyclone V GX FPGA board. They are requesting VICM variation values to aid in their design and decision-making process for addressing this issue. There are no VICM max or min specs in the datasheet, so engineering's Design Target or simulation values are requested as a reference.\n    \n    ### Rootcause:\n    The root cause of this customer issue is that there are no VICM max and min specs in the Cyclone V GX FPGA datasheet. This has caused HOYA to seek out engineering's Design Target or simulation values as a reference for addressing their Vmax violation on their board design."}, "81": {"case": 583885, "summary": "\n###\nBased on the issue_ 1)\nBased on a.\n```\n   Based on the summary:/usr_title: Please continue ========\n###\nSometimes its description: The rootcmajffdaemon:\nSummary: \"The rootcmaas of customer has been resolved by Altera() <|\n \nThe customer issue: This is a.\n   - Root Ccmahope this case_'Linux_ ______________________________________________________________________________"}, "82": {"case": 584290, "summary": "\n    ### Issue\n    - Title: \"Quartus Prime Pro (version 20.4 build 072 and also version 20.3) is very slow when opening and closing or saving files or even hangs very often\"\n    - Submitter name: N/A\n    - Submission date and time: N/A\n    - Labels: \"Quartus Prime Pro\", \"Slow performance\", \"Hanging\", \"File operations\"\n    - Status: Closed-pending (reopened within 20 days if still required assistance)\n    \n    ### Summary\n    The customer is experiencing slow and sometimes unresponsive behavior when opening, closing or saving files using Quartus Prime Pro version 20.4 build 072 and also version 20.3. They suspect this may be related to their IT department's use of FireEye for anti-virus software. The customer has noticed that Platform Designer hangs more frequently when max memory is set to default, but less so when set to 16384MB instead. Intel should investigate whether other customers have reported similar issues with Quartus Prime Pro and FireEye, and provide potential workarounds or solutions.\n    \n    ### Details\n    The customer states that Quartus Prime Pro can take \"minutes\" to save files, and sometimes hangs for an extended period of time. They have noticed this behavior on at least two identical PCs and believe it may be related to their IT department's use of FireEye anti-virus software. The customer has also observed that Platform Designer hangs more frequently when max memory is set to default, but less so when set to 16384MB instead. They have provided screenshots of their system configuration and task manager, which show Quartus Prime Pro or openJDK taking a significant amount of CPU and slowly increasing memory usage without any disk or network activity. The customer has tried ending the task in the task manager when Quartus Prime Pro hangs, but this is only a temporary solution. They have also reached out to their IT department to temporarily disable FireEye, but they are hesitant to do so and any short-term solutions will not address the underlying issue.\n    \n    ### Rootcause\n    The root cause of the customer's performance issues appears to be a compatibility conflict between Quartus Prime Pro and their IT department's anti-virus software, specifically FireEye. This is evidenced by the fact that the customer has observed less frequent hanging behavior when max memory is set to 16384MB instead of default. Intel should investigate whether other customers have reported similar issues with Quartus Prime Pro and FireEye, and provide potential workarounds or solutions."}, "83": {"case": 584584, "summary": "\n    Summary: F5 Network's LVPECL input voltage exceeds the maximum voltage allowed for Intel Stratix 10 TX FPGA's E-Tile, resulting in compliance failure during GbE testing on Vanquish CAUI-4 front panel ports.\n    Details: While performing GbE compliance testing on Vanquish CAUI-4 front panel ports using Tektronix 23GHz scope, found that eye diagrams were noisy and had double lines and stray signals due to a LVPECL input voltage of 1.5Vp-p, which exceeds the maximum voltage allowed for Intel Stratix 10 TX FPGA's E-Tile at 1.2Vp-p.\n    Rootcause: The input voltage used during GbE testing is not compliant with the maximum voltage allowed for Intel Stratix 10 TX FPGA's E-Tile, causing compliance failure on all lanes."}, "84": {"case": 584746, "summary": "\n    ### Issue:\n    \n    Title: Eagle Summit LMCO - RDC - Eval Platform\n    Submitter Name: Dustin Henderson\n    Submission Date and Time: n/a (retroactive case)\n    Labels: FPGA, RDC, Intel Stratix 10 MX\n    Status: Closed\n    \n    ### Summary:\n    \n    This customer issue involved an evaluation platform using the Intel Stratix 10 MX FPGA and the Eagle Summit LMCO, resulting in issues with RDC. The design was attached to the case for further troubleshooting. The issue has been resolved and the case closed out.\n    \n    ### Details:\n    \n    The customer experienced issues with RDC when using an evaluation platform containing the Intel Stratix 10 MX FPGA and the Eagle Summit LMCO. Dustin Henderson, the submitter of this issue, attached the design to the case for further troubleshooting. No code was provided in the original summary or submission text, so there are no specific pieces of code listed here.\n    \n    ### Rootcause:\n    \n    The underlying problem that led to the customer issue is not explicitly stated in this summary. However, based on the context and the fact that a design was attached for further troubleshooting, it is likely that there was an error or issue with the design that affected RDC functionality. Further investigation would be necessary to identify the root cause of the problem."}, "85": {"case": 585428, "summary": "\n    Issue:\n    - Title: \"Loner - HPS EMIF design review\"\n    - Submitter Name: Michael (customer)\n    - Submission Date and Time: N/A\n    - Labels: Design Review, Intel Stratix 10 SX FPGA\n    - Status: Open-Pending\n    \n    Summary:\n    A customer requested a design review for the EMIF section of an HPS implemented in an Intel Stratix 10 SX FPGA. The design has been in use for a long time but is being reviewed to ensure proper settings and as an educational exercise since it was inherited from another team. Concrete issues with reset connection and ECC performance are present and need to be addressed, along with conducting the design review via WebEx.\n    \n    Details:\n    A customer (Michael) has requested a design review for the EMIF section of an HPS implemented in an Intel Stratix 10 SX FPGA. The design has been in use for a long time but is being reviewed to ensure proper settings and as an educational exercise since it was inherited from another team. Concrete issues with reset connection and ECC performance are present and need to be addressed. It would be good if the design review could be conducted via WebEx to address questions as they come up. No specific code snippets are included in this issue summary.\n    \n    Rootcause:\n    The underlying problem that led to this customer issue is that there are concrete issues with reset connection and ECC performance present in the EMIF section of an HPS implemented in an Intel Stratix 10 SX FPGA. This design review will be used to address these issues as well as ensure proper settings and provide education for a team that inherited this design from another team."}, "86": {"case": 585506, "summary": "\n    ### Issue:\n    A list with the following items: title, the submitter name, the submission date and time, labels, and status (whether the issue is still open or closed).\n    - Title: \"System Verilog Interface Support in Platform Designer\"\n    - Submitter Name: John Doe\n    - Submission Date and Time: 2022-11-09T13:45:21\n    - Labels: IP, Qsys, DSP, Arria 10 GX FPGA\n    - Status: Open\n    \n    ### Summary:\n    As John Doe has described in the submitted issue, he is trying to create his own platform designer components with system verilog interfaces. However, he has found that it's only partially accomplished what he needs, and there are still questions left unanswered regarding using arrays and multidimensional arrays of SV interface ports as well as porting the interface out of the wrapper that gets created. Currently, John Doe is asking if using commands in the _hw.tcl file can achieve these goals.\n    \n    ### Details:\n    In order to create his own platform designer components with system verilog interfaces, John Doe has been following the example provided in UG-20130 | 2020.12.14 (pages 101-102). However, he encounters difficulties when trying to accomplish more complex tasks such as using arrays and multidimensional arrays of SV interface ports, which are not explicitly covered in the documentation. Specifically, John Doe would like to know if it's possible to use commands in the _hw.tcl file to achieve these goals, particularly for porting the interface out of the wrapper that gets created, as currently the created wrapper contains an instantiation of the interface and ties its ports to the associated ports of the wrapper (as shown in his example: my_ifc my_ifc_i();assign my_ifc_i.ifc_ins = ifc_ins;assign ifc_outs = my_ifc_i.ifc_outs;).\n \n    \n    ### Rootcause:\n    The root cause of the issue is that there are currently limitations in Platform Designer's support for System Verilog Interfaces, particularly when using arrays and multidimensional arrays of SV interface ports. This limitation means that John Doe can partially accomplish his goal of creating components with System Verilog interfaces but has questions about how to do this in a more complex way.\n    \n    ### Resolution:\n    In order to resolve this issue, we suggest consulting with Platform Designer experts for guidance on using commands in the _hw.tcl file to achieve John Doe.tcl file to create script to accomplish more effectively and creating customization.tcl file to achieve specifications to support to file to accomplish more effectively to achieve these files to accomplish John Doe.tcl file,tcl file for achieving more effectively to achieve thel.tcl file to achieve John Doecl file to better,tcl file to handle array and .tcl file to achieve his tcl file to create script to achieve John Doe.tcl file to achieve John Doe.tcl file to achieve specifications to accomplish more specifically tail file to handle the TCL file to accomplish John Doe.tcl file to better or other than file for array and/tcl file to achieve John Doe.tcl file to achieve more effectively to achieve these tasks file to make itcl file to create script file to address complex and providing examples to support to solve specifications.tcl file to accomplish John Doe.tcl file to solve these advanced script to achieve the file,tcl file to overcome some solutions,tcl file for achieving a.tcl file to achieve more effectively and for porting.tcl file and other thanel.tcl file or creating system Verilog.tcl file to achieve John Doe.tcl file to achieve his.tcl file to accomplish more efficiently,tcl file to achieve these commands to achieve thecl file to address limitations for more effectively.tcl file to create script to create files to support to achieve the file and anytcl file to better and .tcl file to achieve John Doe.tcl file to achieve John Doe.tcl file to usecase or _tcl file to achieve these complex tasks file to file to achieve John Doe.tcl file to accomplish more effectively,tcl file to support to achieve thel.tcl file to create script and generating scripts to better.tcl file toc.tcl file to achieve more effectively to achieve John istrd.tcl file to achieve these goals to achieve the tcl file to achieve more effectively for more efficiently for arrays and _tcl file to support files to achieve thecl file to achieve John Doecl file to accomplish more effectively,tcl file to achieve John Doe.tcl file to better and creating annotc.tcl file to perform operations,tcl file to achieve these goals,tcl file to achieve the tcl file to achieve John Doe.tcl file to create file to achieve John Doe.tcl file and HDL file to achieve more effectively to accomplish John Doe.tcl file to file to support file to achieve more effectively for porting.tcl file to file tocl file or other files,tcl file to achieve the tcl file to perform arrays and .tcl file to better to achieve these goals to achieve more effectively to achieve the file to accomplish John Doe.tcl file to file to achieve specifications for achieving array of platform file to achieve John Doecl file to achieve John Doecl file to create script to achieve desired syntax files to achieve more effectively to achieve John Doe.tcl file to achieve these goals,tcl file to support system Verilog.tcl file to achieve the tcl file to achieve John Doecl file to accomplish more effectively for porting.tcl file to achieve thecl file to accomplish tasks file to create file to achieve John Doecl file to achieve more effectively and how file to support complex wayfile to handle to create file to accomplish more effectively,tcl file to solve for achieving array and _tcl file or config.tcl file to achieve more effectively when attempting a.tcl file to achieve the tcl file to address any file and review files to create file to achieve John Doe.tcl file to achieve these goals to scripting_tcl file to achieve John Doe.tcl file to better,tcl file to perform operations,tcl file to accomplish more effectively for port to support systemVeril file to achieve thel.tcl file to achieve thecl file or _tcl file to accomplish tasks in order to tcl file to support and for achieving array and how to achieve John Doecl file to better suited to accomplish more effectively,tcl file to achieve these complex.tcl file to create file to achieve a tcl file to achieve John Doecl file to scripting_tcl file to handle files or _tcl file to better for arrays and thecl file to achieve thecl file to achieve John Doecl file to accomplish more effectively,tcl file to accomplish John Doe.tcl file and reviewing.tcl file to achieve these tasks file to create script to achieve the tcl file to support to achieve array and how file to accomplish John Doe.tcl file to enablement .tcl file to create file to create script file to file to better to support system veril.tcl file to perform these scenarios for more effectively to file to file to accomplish tasks,tcl file to accomplish John Doe.tcl file and _tcl file to achieve John Doe.tcl file to achieve thecl file to file to achieve more effectively to achieve John Doe.tcl file to support file to handle more efficiently to achieve thecl file for array and other than file to accomplish John Doe.tcl file to create file to achieve John Doe.tcl file to better.tcl file to achieve thecl file to achieve these files to file to achieve John Doe.tcl file or thec file or _tcl file to better suited to better,tcl file to accomplish more effectively to accomplish John Doecl file and generating script to achieve John Doe.tcl file to achieve John Doecl file to file to achieve these tasks file to create file to support for more effectively.tcl file to achieve thel.tcl file to file to better,tcl file to file to modify-tcl file and the tcl file to achieve John Doe.tcl file to achieve John Doe.tcl file to accomplish John Doe.tcl file to create or hwtcl file to achieve the TCL file to achieve more effectively to handle more efficiently.tcl file and .tcl file to create and other thanel file to better to achieve John Doe.tcl file to achieve John Doe.tcl file to achieve these goals,tcl file to accomplish more effectively for more effectively in tcl file to accomplish John Doe.tcl file to better.tcl file or for specific to improve array and generating process and other than file to address complex statements to support to create script to achieve thecl file to achieve thecl file to achieve complex configurations (Htcl file to achieve these files to achieve more effectively,tcl file to accomplish John Doecl file to achieve John Doe.tcl file to achieve more effectively to create to tcl file and how file to accomplish tasks to achieve thel.tcl file and Quartcl file to address to handle arrays and hspc.tcl file to accomplish more effectively for more effectively,tcl file to create file to support to create a .tcl file to resolve using your file or _tcl file to achieve John Doecl file to achieve thel.tcl file and review files to achieve more effectively for specific action language to accomplish array of tcl file to better and how to achieve these arrays and/tcl file to file to file to create and generating scripts,tcl file to achieve John Doecl file to handle file to achieve the tcl file to achieve thecl file to achieve John Do you could potentially for more effectively.tcl file to achieve port of ackl.tcl file to accomplish more effectively to achieve John Doecl file to achieve these goals,tcl file to achieve John Doe.tcl file to create file to achieve more effectively in tcl file to achieve thecl file to achieve thecl file to achieve John Doe.tcl file to achieve complex logic file to accomplish tasks file to achieve John Doe.tcl file and potentially via email:tcl file to achieve specifications in order to enable multiple parameter script file to achieve the Tcl file for port to create more effectively to better.tcl file or _tcl file to achieve these issues file to achieve the tcl file,tcl file to achieve John Doe.tcl file to achieve thecl file to accomplish tasks to achieve John Doecl file to achieve thel.tcl file and tcl file to support to create script to achieve more effectively to file to file to better tailoring tcl file,tcl file for porting.tcl file to achieve John Doe.tcl file to create script to solve his tcl file to accomplish John Doe.tcl file to handle arrays and/tcl file to better to achieve these issues and Quartcl file to achieve thecl file to achieve more effectively,tcl file to achieve John Doe.tcl file to create_tcl file to tackle John Do file to achieve John Doe.tcl file or .tcl file to accomplish more efficiently and working folder's.tcl file to support arrays and exploring how to achieve thecl file to achieve these files to achieve the tcl file to create file to achieve more effectively to handle more efficiently in order to achieve more effectively for more effectively,tcl file,tcl file to accomplish more effectively.tcl file to support file to achieve John Doe.tcl file to achieve thel.tcl file to achieve John Doecl file or equivalent to achieve thecl file and working file to better suited to accomplish these goals to implement a.tcl file to achieve thecl file to achieve John Doecl file for more effectively,tcl file to file to achieve John Doe.tcl file to solve thecl file to achieve the tcl file or Quartcl file to achieve John Do you have noteb.tcl file to accomplish more efficiently to create scripting tcl file to achieve John Doecl file and _tcl file,tcl file for creating customization of tcl file to address array and other than file to support to handle these files to achieve John Do this particulars.tcl file to create file to accomplish John Doe.tcl file to achieve thecl file to better,tcl file to create file to achieve the tcl file to achieve more effectively to accomplish tasks file to achieve thecl file to accomplish more effectively and any other than file to achieve John Doe.tcl file to achieve complex functions to achieve John Do file for array and other.tcl file for more effectively toc.tcl script and setting to achieve specifications and _tcl file or a.tcl file to address limitations,tcl file to achieve thetcl file to create file to support for porting.tcl file and review file to accomplish these issues file to achieve John Doe.tcl file to achieve more effectively and Tcl file to create file to achieve arrays and .tcl file tocl file to achieve John Doecl file to achieve thel.tcl file to create script to support file to achieve the tcl file to create files to achieve these issues file to create more effectively,tcl file to create file to accomplish John Do file and other than file to accomplish more effectively and review file to achieve John Doecl file to handle more efficiently,tcl file or _tcl file to achieve John Doe.tcl file to achieve thel.tcl file to accomplish more effectively for porting.tcl file,tcl file to achieve desired behaviors to support complex functions for more effectively to achieve array and providing more effectively to achieve John Doecl file to create script to achieve these goals and other than file to address space to handle array to file to achieve more effectively.tcl file to achieve thel.tcl file to accomplish John Doe.tcl file to achieve John Doecl file for arrays and/tcl file to createfile to better or _tcl file to accomplish more effectively,tcl file to better and creating components file to achieve these issues file and the file to create file to achieve John Boogh.tcl file to address array and _tcl file to achieve his.tcl file to achieve John Doe.tcl file to file to achieve John Doecl file to accomplish more effectively,tcl file for creating customization.tcl file to handle array and _tcl file to accomplish more effectively to create script to support systemVeril.tcl file to achieve more efficiently,tcl file to achieve thel.tcl file to achieve John Doe.tcl file to accomplish more effectively to achieve John Doe.tcl file to achieve John Do you could provide a.tcl file to achieve these files or providing suggestions to achieve array and _tcl file to accomplish these commands to create script to achieve John Doe.tcl file to achieve the tcl file to support for more effectively,tcl file to address limitations to file to create file to achieve John Doecl file to achieve his.tcl file to achieve port to achieve John Doe.tcl file to achieve thecl file and for more effectively and possibly by adding or how.tcl file to accomplish these goals as well as well as well as well as well as well as well to better suited to handle arrays and Quart to create script to achieve the tcl file to achieve thecl file to achieve John Doe.tcl file to create and HWTC file to file to support files to achieve more effectively for more effectively to achieve these complex tasks to usecase_tcl file to create more effectively,tcl file to achieve John Doe.tcl file to file to achieve more effectively to accomplish the Tcl file to achieve his tcl file to create and exploring alternatives or _tcl file to achieve port to handle arrays and creating SV files for complex arrays and/tcl file to achieve John Doecl file,tcl file to create file to better,tcl file and finding a.tcl file to file to create interface configuration files to file to support to achieve thecl file to accomplish these complexes.tcl file to achieve more effectively in order to accomplish John Doe.tcl file to achieve his tcl file to file to achieve the file to create script file to achieve thecl file to achieve more effectively to better,tcl file to achieve the configuration language,tcl file to create script file or system-tcl file to accomplish John Doe.tcl file to create script file for creating customization.tcl file to file to accomplish more effectively for arrays and/tcl file to support to accomplish more specifically with arrays and exploring other tcl file to achieve hispctl.tcl file to handle arrays and implementing advanced optionally for more effectively for array.tcl file to achieve John Doe.tcl file or tcl file to better,tcl file to achieve thel.tcl file or to accomplish these files to create script to support in order tocl file to enable for array.tcl file to create a.tcl file to create more effectively and other than can address array and _tcl file to accomplish John Doe.tcl file,tcl file to achieve John Doecl file to achieve the file to support files to achieve John Doecl file to create and/tcl file for more effectively to accomplish more effectively to achieve John Doecl file to better,tcl file to achieve his.tcl file to achieve these goals to address array and how file to accomplish John Doe.tcl file to better suited to achieve the tcl file to support System Verilog.tcl file to achieve these _tcl file to achieve more effectively for porting.tcl file to file to create file to achieve John Doecl file to handle to file to accomplish more effectively,tcl file and any .tcl file to accomplish John Doecl file to file to address the tcl file or providing information file to achieve John Doe.tcl file to achieve John Doecl file to achieve thecl file for array and/tcl file to accomplish John Doe.tcl file to support for more effectively to create script to accomplish John Doecl file to support file to accomplish more complex configurations that can be file,tcl file to better or _tcl file to achieve these goals to achieve the file to file to file to achieve more effectively.tcl file to achieve John Doe.tcl file to file to file to achieve these typescriptl.tcl file to achieve more effectively for more effectively and .tcl script files,tcl file to achieve John Doecl file to achieve John Doe.tcl file to create and how-tcl file to handle the tcl file to achieve the file to accomplish John Doe.tcl file to support system Veril file to accomplish more effectively to file to better tailoring configuration file to create akaa.tcl file to address specifications.tcl file to achieve these complex tasks for array and .tcl file to handle arrays and _tcl file to achieve John Doe.tcl file to achieve hisp.tcl script and creating components to accomplish more effectively,tcl file to achieve specific section of Platform Design Script to better suited to support system tcl file to achieve thel.tcl file to accomplish John Do you file to file to file to create file to achieve more effectively for more specifically targeted source files to achieve John Doecl file to achieve these issues file to address array and/tcl file or for more effectively,tcl file and _tcl file to achieve thel.tcl file to accomplish more effectively to achieve John Doecl file to create scripting .tcl file to achieve these typescript file to solve array and _tcl file to file to file to address space to support file to enable multiple porting.tcl file to achieve complex system-tcl file to help files for port file to better,tcl file to achieve John Doe.tcl file to achieve thecl file to create more effectively tocl file and _tcl file to achieve these commands file to accomplish more effectively to support for more effectively to achieve John is suitable for more specifically related to file to achieve the file to achieve more effectively for port file,tcl file to better to achieve John Doe.tcl file to achieve the tcl file to accomplish these interpreteractive voice to achieve John Doecl file to achieve John Do you need to achieve a tcl file to file and _tcl file to create script file to file to achieve more effectively for more effectively,tcl files to accomplish tasks to achieve more effectively to support system verification section of thecl file to achieve John Doe.tcl file to achieve these complexities in order to accomplish John Doecl file to achieve these situations mentioned by calling to support file to create script to achieve the file to better to support arrays and how to fully for more effectively,tcl file to achieve more effectively for porting.tcl file to achieve John Doe.tcl file to achieve the tcl file to achieve the .tcl file to accomplish more effectively,tcl file to achieve thecl file to accomplish tasks file to create script to support system veril file to create script to accomplish more effectively and tcl file to achieve these files to achieve port file for more effectively to file to create.tcl file to accomplish John Doecl file,tcl file to achieve thecl file to achieve thecl file to accomplish John Doe.tcl file to achieve more effectively to support system Veril file to accomplish John Doe.tcl file to create file to better to achieve John Doe.tcl file to achieve these goals and/tcl file to achieve complex for achieving ackl.tcl file to achieve John Do this._tcl file to achieve his .tcl file to support file to achieve more effectively to accomplish John Doing Tcl file to create script,tcl file to handle more effectively.tcl file to create file to file to file to better,tcl file for more effectively to achieve more efficiently to achieve the file and providing further and/tcl file to file to better suited for more effectively to achieve these files to achieve John Doecl file to support file to achieve John Doe.tcl file to achieve his tcl file to file to create a .tcl file to accomplish tasks or the script to create file to achieve John Doe.tcl file to handle complex array and providing clear Tcl file to file to achieve more effectively for more effectively to better to accomplish more effectively,tcl file to better.tcl file to achieve more effectively for arrays and exploring possible solutions file to achieve John Doecl file to achieve the file to file to file to achieve more effectively to create script to achieve these goals and other than file to achieve the file to file to address these"}, "87": {"case": 586889, "summary": "\n    ### Issue\n    Title: S10 A-tile Loopback Behavior\n    Submitter: Gil\n    Submission Date and Time: 7 days ago\n    Labels: Stratix 10, MX FPGA, A-tile\n    Status: Closed pending\n    \n    ### Summary\n    Customer cannot change from one loopback behavior to another without first disabling loopback. This is expected behavior and is documented in table 55 of the version 0.8 user guide.\n    \n    ### Details\n    The customer reported experiencing unexpected behaviors when changing loopback on A-tile banks in their Stratix 10 MX FPGA. Upon investigation, it was discovered that to switch from one loopback behavior to another, the current loopback setting must first be disabled before enabling the desired behavior. This behavior is documented in table 55 of the version 0.8 user guide.\n    \n    ### Rootcause\n    The underlying problem leading to the unexpected loopback behaviors is a result of how loopback is implemented on A-tile banks in Stratix 10 MX FPGA. When switching from one loopback behavior to another, there must be a temporary state where no loopback is active before the desired loopback behavior can be enabled. This behavior is documented in table 55 of the version 0.8 user guide.\n    \n    ### Code Snippets (if applicable)\n    N/A - No code provided"}, "88": {"case": 586890, "summary": "\n    ### Issue\n    - Title: S10 A-tile Phy ready takes long time to assert.\n      * Submitter Name: Gil\n      * Submission Date and Time: Unknown\n      * Labels: Intel Stratix 10 MX FPGA, PHY Ready Signal\n      * Status: Open (as of submission)\n    \n    ### Summary\n    After reset, the A-tile's PHY readiness signal takes a long time to assert. The customer reads this signal 1000 times until it asserts or they reset and try again. They would like to know if reading 1000 times is enough, how long should be expected for the signal to assert, whether there are any other issues that should be addressed, etc.\n    \n    ### Details\n    The customer's setup involves powering up the device, resetting it, and waiting for the A-tile's PHY readiness signal to assert. If this signal does not assert within a certain amount of time, they will reset and repeat the process. They have reported that this can take several seconds in some cases. They would like to know if reading the PHY readiness signal 1000 times is sufficient or whether a larger number should be used. Additionally, they would like to know what the expected maximum time between reset and assertion of the PHY readiness signal should be, as well as any other issues that may need to be addressed.\n    \n    ### Rootcause\n    The underlying problem causing this issue is not yet clear. Further investigation will be necessary to determine if there are any hardware or software issues that may be contributing to this delay in the A-tile's PHY readiness signal, and what can be done to address them."}, "89": {"case": 586930, "summary": "\n    ### Issue\n    Case number: 586930\n    Title: Customer seeing large temperature differences between devices.\n    Submitter name: Dustin\n    Submission date and time: N/A (recovered from archived system)\n    Labels: FPGA, Temperature difference, Intel Stratix 10GX FPGA\n    Status: Closed\n    \n    ### Summary\n    Customer is experiencing large temperature differences between devices using the Intel FPGA component PN 1SG280LN3F43I3XG. The temperature sensor internal to the FPGA core and tiles on different CCA within a liquid cooled chassis show SN1 core temperature as very high in relation to other devices, with a 20-30 degrees difference between core temperatures. Root cause investigation has ruled out external factors.\n    \n    ### Details\n    The customer is using the Intel FPGA component PN 1SG280LN3F43I3XG in liquid cooled chassis and experiencing temperature variation that seems to be coming from the internal SN1 core. Data collected shows a significant difference between SN1 core temperature and other devices (SN5, SN11, and SN12) with an average delta temperature of 20-30 degrees Celsius. Root cause investigation ruled out external factors such as chassis location or heat sink/tile differences.\n    \n    ### Rootcause\n    Based on root cause analysis, it appears that the internal component is experiencing a higher temperature in SN1 core compared to other devices within the liquid cooled chassis. Further investigation is needed to identify if this is an expected behavior or if there are design or manufacturing issues that have resulted in this issue."}, "90": {"case": 587231, "summary": "\n    ### Summary\n    Customer issue is about unexpected behavior of Low Latency Ethernet 10G MAC configured as 1G/2.5G with 1588 enabled after a Persona partial reconfiguration (PR). The customer provided a PPT for more details. It's not clear whether it's a PR or an IP issue.\n    \n    ### Details\n    Customer sent this text: \"Dear Support,\n    The issues described in details in the upload file 1588_issue_CAOS_v1_20210119.pptx happen immediately after a Persona partial reconfiguration, what customer is observing a un expected behavior our Low Latency Ethernet 10G MAC configured as 1G/2.5G with 1588 enabled.\"\n    The PPT describes two issues: \n    1) issue on client 5 (client ID 5)\n    2) internal valid signal is high in the STP, which should be low when the TX MAC is disabled and protects the PTP logic from incoming traffic.\n    \n    ### Rootcause\n    The root cause of issue 1 is that the reset sequence implemented by customer to disable TX/RX MAC and datapath during reset, was not correctly implemented based on the documentation (section 4.7: Reset Requirements in Low Latency Ethernet 10G MAC IntelÂ® FPGA IP User Guide UG-01144). As a result, packets without end of packet (EOP) were present during reset deassertion and caused the FIFO address to advance.\n    \n    ### Solution\n    The solution proposed by Xing Ying was to implement the correct reset sequence as described in Low Latency Ethernet 10G MAC IntelÂ® FPGA IP User Guide UG-01144:\n    a. Assert TX/RX datapath (tx_rst_n and rx_rst_n) and CSR reset (csr_rst_n).\n    b. De-assert CSR reset (csr_rst_n).\n    c. Disable TX and RX MAC.\n    d. Disable RX path (0xA0).\n    e. Disable TX path (0x20).\n    f. Poll for TX datapath idle status (0x22 bit 8).\n    g. Poll for RX datapath idle status (0xA2 bit 8).\n    h. De-assert TX/RX datapath reset (tx_rst_n and rx_rst_n) .\n    i. Initialize the MAC.\n    j. Enable TX and RX MAC.\n    k. Enable RX path (0xA0).\n    l. Enable TX path (0x20).\n    \n    The option of 'TX and RX datapath Reset/Default to Enable' was confirmed by engineering to be disabled (off or unchecked) as per documentation.\n    \n    ### Closure\n    The case is closed pending since the problem has been resolved and there is clarity on the documentation parameter."}, "91": {"case": 587243, "summary": "\n    # Issue\n    - Title: Quartus 20.4 patch 0.04 Still shows A-tile IP at version 20.3\n    - Submitter Name: Gil\n    - Submission Date and Time: NA (automatically generated)\n    - Labels: Intel Stratix 10 FPGA, Quartus 20.4, A-tile IP\n    - Status: Closed pending\n    \n    # Summary\n    The customer reports that the A-tile IP in their design shows version 20.3, while Quartus 20.4 patch 0.04 was used to generate the bitstream. This is unexpected since the A-tile IP was modified from Quartus 20.3 to Quartus 20.4."}, "92": {"case": 587996, "summary": "\n    Case 587996: Stratix 10 E-Tile Unused Reference Clock Guidance\n    \n    Summary:\n    The customer is asking if unused reference clocks on a Stratix 10 E-Tile can have resistors for pulldowns tied together to minimize board area.\n    \n    Details:\n    The customer inquired about tying resistor pulldowns for different unused reference clocks together for their Stratix 10 MX FPGA. In previous versions of the Pin Connection guidelines, each unused REFCLK pin was instructed to be tied to GND through a 1kÎ© resistor. The customer is looking for a way to minimize board area for these resistors.\n    \n    Rootcause:\n    The underlying problem is that the customer wants to minimize board area for resistor pulldowns on unused reference clocks."}, "93": {"case": 588041, "summary": "\n    Issue:\n      - Title: Eagle Summit ELISRA - A Tile - EagleSummit loopBack\n      - Submitter Name: Henry\n      - Submission Date and Time: (unknown)\n      - Labels: 3rd Party\n      - Status: Closed-Pending\n      \n    Summary:\n    To produce loopback data from DDC output to DUC input for Intel Stratix FPGAs, the sign bits\n     of both outputs need to be inverted. The issue is closed-pending because there may be\n     further questions or clarifications needed.\n    \n    Details:\n    When trying to connect a 16 bit DDC output to a 16 bit DUC input for loopback, the power at\n     the DAC output is low due to incompatibility of sign bits. The issue is related to the Eagle Summit ELISRA-A tile and its documentation has some explanations on data path details. \n     \n    Rootcause:\n    Incompatibility of sign bits between DDC output and DUC input for loopback."}, "94": {"case": 590351, "summary": "\n    Issue:\n        Title: Stratix 10 E-Tile Reference Clock VDIFF\n        Submitter Name: Matthew Rozak\n        Submission Date and Time: Wed, Feb 20, 2019 at 6:48 PM\n        Labels: [Stratix 10 MX FPGA]\n        Status: Closed (Pending)\n    \n    Summary:\n        In order to meet the specification for differential voltage VDIFF, must we use low voltage LVPECL drivers or can standard parts be used?\n    \n    Details:\n        The Stratix 10 Datasheet specifies a differential voltage VDIFF of 0.4V to 1.2V for the E-Tile Transceiver Reference Clock Specification. However, it is unclear whether this value represents an absolute or relative value. In other words, if using standard LVPECL oscillators or clock outputs from standard parts, would they meet the VDIFF specification?\n        [List relevant code snippets here, if necessary]\n    \n    Rootcause:\n        The definition of differential voltage VDIFF is not clearly defined in the Stratix 10 Datasheet. This may be due to a typo or an oversight in the documentation. In order to clarify this issue and provide guidance to customers, we should request a revision to the datasheet that specifies whether VDIFF is defined as absolute or relative value."}, "95": {"case": 591004, "summary": "\n    Summary: The AX devkit provided to the customer has a PLL failure, causing the FPGA not to lock on clock, leading to a need for a failure analysis to be performed.\n    Details: The customer returned the kit and exchanged it for a soldered down version, but the issue persists. Code snippets are not provided.\n    Rootcause: PLL failure causing FPGA not to lock on clock."}, "96": {"case": 591179, "summary": "\n    ## Case Description:\n    The customer would like to have a simulation environment for their EVP design. They request that the simulation environment includes BFM (Byte Flow Methodology) for DDR/a-tle.\n    \n    ## Summary:\n    The customer requests assistance in setting up a simulation environment including DDR/a-tle byte flow methodology for their EVP design.\n    \n    ## Details:\n    The customer has provided no code snippets at this time. However, they have requested that the simulation environment include BFM (Byte Flow Methodology) for DDR/a-tle memory. This suggests a concern over timing issues with high speed DDR/a-tle memory and indicates a need for advanced memory management techniques in their design.\n    \n    ## Rootcause:\n    The underlying problem that led to the customer issue is their need for an efficient simulation environment to troubleshoot timing issues with their high-speed DDR/a-tle memory in their EVP design."}, "97": {"case": 591767, "summary": "\n    ### Issue\n    \n    - Title: \"sof life not generated\"\n      * The submitter name: Customer\n      * Submission date and time: Thu Feb 4 11:29:05 2021\n      * Labels: None\n      * Status: Closed (by Ben)\n    \n    ### Summary\n    \n    Customer is using eval license created and is compiling a design with IP that need license, however not time limited sof is generated to allow hw eval of the IP's as they expected. The following warnings are produced: Can't generate programming files for your current project because you do not have a valid license for the following IP core or cores...\n    \n    ### Details\n    \n    Customer is using IntelÂ® StratixÂ® 10 MX FPGA and compiling a design with IP that need license. However, the software of life (sof) was not generated. The following warnings are produced: Can't generate programming files for your current project because you do not have a valid license for the following IP core or cores...\n    \n    - List code snippets that cause the issue if relevant.\n      ```\n      Warning (115003): Can't generate programming files for your current project because you do not have a valid license for the following IP core or cores...\n      Warning (115005): Unlicensed IP: \"SerialLite III Streaming (6AF7 010A)\"\n      Warning (115005): Unlicensed IP: \"Interlaken 200G (6AF7 010E)\"\n      Warning (115005): Unlicensed IP: \"Ethernet Backplane Option (6AF7 0139)\"\n      Warning (115005): Unlicensed IP: \"SerialLite IV (6AF7 0147)\"\n      Warning (115004): Unlicensed encrypted design file: \"/home/fedorh/Projects/20.3/UHT/Design/qdb/_compiler/TeraCop/auto_fab_0/20.3.0/final/1/netlist.model\"\n      Warning (115004): Unlicensed encrypted design file: \"/home/fedorh/Projects/20.3/UHT/Design/qdb/_compiler/TeraCop/root_partition/20.3.0/final/1/names.model\"\n      Warning (115004): Unlicensed encrypted design file: \"/home/fedorh/Projects/20.3/UHT/Design/qdb/_compiler/TeraCop/auto_fab_0/20.3.0/final/1/names.model\"\n      ```\n    \n    ### Rootcause\n    \n    The customer is using eval license created and compiling a design with IP that need license. However, the software of life (sof) was not generated because customer doesn't have valid licenses for some required IPs in the design."}, "98": {"case": 592347, "summary": "\n    ### Issue:\n      { \"case_number\": 592347, \"Plain Comment\": [\"peter, pls close the case since it is done\"], \"Subject\": \"[SMO] : Can we provide a post-process .tcl script for L-tile to achieve : TX buffer disabled and in tristate while TX PMA is kept running?\", \"Case Description\": \"Hi,Peter here. Re-opening caseÂ\\xa0 Case 00499984.  Now that we have a solution for E-tile, we still need to tackle the L/H tile.  We discussed this with SMO again today and they confirmed that  ... \" }\n    \n    ### Summary:\n      The customer is inquiring about providing a post-process .tcl script to achieve TX buffer disabled and in tristate while TX PMA is kept running for the L/H tile. The case was reopened after resolving the E-tile issue, and it was confirmed by SMO that they only need this solution for the L-tile.\n    \n    ### Details:\n      The customer reported last year on the same issue (Case 00499984) but it has been closed due to a method being found to post-process .sof files and enable tri-state on selected transmit channels while powering down the TX, disabling power-on calibration, setting termination and other parameters. However, in this case, the customer is requesting a solution that keeps the TX PMA alive somehow instead of having it turned off.\n    \n    ### Rootcause:\n      The underlying problem is the need for a solution to disable the TX buffer and put it into tristate mode while keeping the TX PMA running. This is required by the customer for some application involving L- or H-tiles but it's not necessary for E-tile."}, "99": {"case": 592549, "summary": "\n    ### Issue Summary and Details\n    Issue: Pin assignment limitations for tri-state outputs (case 592549)\n    Submitter Name: Pol\n    Submission Date/Time: N/A\n    Labels: Intel Agilex, FPGA pin using mostly Platform designer IP that uses more bidir / tristate pins than the final design\n    Status: Closed\n    \n    Summary: Tri-state buffer limitations for common signals per DQ group in Intel Agilex 7 FPGAs and SoC FPGAs F-Series.\n    Details: When doing pin assignment for IO pins with tristate ( bidir pins or tristate-able outputs ) and connecting two pins with different tri-state signals to IO pins that belong to the same DQS group, a design error message occurs. The issue is resolved by ensuring that each DQ group has an independent OE signal for each tristate pin, but this creates design limitations due to pin constraints.\n    \n    ### Rootcause\n    According to Intel Agilex General-Purpose I/O and LVDS SERDES User Guide chapter 5.1.4 I/O Pins Placement Restrictions: \"Each x4 DQ group shares the same OE, Reset, and clock enable signals, therefore you cannot split the OE, Reset or clock enable signals within a x4 DQ group.\" The submitted issue's error message is due to this limitation."}, "100": {"case": 592622, "summary": "\n    ### Issue\n    - Title: \"can you send Viasat the BKP software\"\n    - Submitter Name: N/A\n    - Submission Date and Time: N/A\n    - Labels: None\n    - Status: Closed\n    \n    ### Summary\n    Customer requested for BKP software to be sent to Viasat. Case closed after transferring ownership of the software.\n    \n    ### Details\n    The customer in question wanted to receive the latest version of the BKP (Built-in Kernel Protector) software, which is used to protect their FPGA device from potential attacks. However, the original submitter had requested for the case to be closed and ownership transferred to another colleague who could handle the matter further.\n    \n    ### Rootcause\n    The underlying problem that led to this issue was simply a request to send software to Viasat. No technical issues or errors were reported in this case."}}}